{
	"version": "https://jsonfeed.org/version/1",
	"title": "Ian Betteridge",
	"icon": "https://micro.blog/ianbetteridge/avatar.jpg",
	"home_page_url": "https://technovia.co.uk/",
	"feed_url": "https://technovia.co.uk/feed.json",
	"items": [
		
			{
				"id": "http://ianbetteridge.micro.blog/2024/01/17/apples-tithe.html",
				"title": "Apple's 27 per cent tithe",
				"content_html": "<p><a href=\"https://9to5mac.com/2024/01/16/apple-revises-us-app-store-rules-to-let-developers-link-to-outside-payment-methods-but-it-will-still-charge-a-commission/\">9to5Mac</a>:</p>\n<blockquote>\n<p>Apple has also confirmed that it will charge a commission on purchases made through alternative payment platforms. This commission will be 12% for developers who are a member of the App Store Small Business Program and 27% for other apps.</p>\n</blockquote>\n<blockquote>\n<p>The commission will apply to “purchases made within seven days after a user taps on an External Purchase Link and continues from the system disclosure sheet to an external website.”</p>\n</blockquote>\n<p>Apple had an chance to turn a legal defeat into a long-term victory. With Google charge 26% in the same circumstances, the company could have adopted rules which dramatically reduced the levy it wants to take, say to 12% for all developers. This would have gained the company a lot of credibility over the long term.</p>\n<p>But no. Instead, it chose to protect short term revenue, and do something which looks petty, hostile to the developers who have made iOS a successful platform, and which will probably end up in court, again.</p>\n<p>When it comes to antitrust, perception matters. And sadly for them, in that area Apple never misses an opportunity to miss an opportunity.</p>\n",
				"content_text": "\n[9to5Mac](https://9to5mac.com/2024/01/16/apple-revises-us-app-store-rules-to-let-developers-link-to-outside-payment-methods-but-it-will-still-charge-a-commission/):\n>Apple has also confirmed that it will charge a commission on purchases made through alternative payment platforms. This commission will be 12% for developers who are a member of the App Store Small Business Program and 27% for other apps.\n\n>The commission will apply to “purchases made within seven days after a user taps on an External Purchase Link and continues from the system disclosure sheet to an external website.”\n\nApple had an chance to turn a legal defeat into a long-term victory. With Google charge 26% in the same circumstances, the company could have adopted rules which dramatically reduced the levy it wants to take, say to 12% for all developers. This would have gained the company a lot of credibility over the long term. \n\nBut no. Instead, it chose to protect short term revenue, and do something which looks petty, hostile to the developers who have made iOS a successful platform, and which will probably end up in court, again. \n\nWhen it comes to antitrust, perception matters. And sadly for them, in that area Apple never misses an opportunity to miss an opportunity.\n",
				"date_published": "2024-01-17T17:31:38+00:00",
				"url": "https://technovia.co.uk/2024/01/17/apples-tithe.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2024/01/10/finally-a-grocery.html",
				"title": "Finally, A Grocery Cart That Can Save Me From The Horror Of An Ad-Free Moment Of Existence",
				"content_html": "<p><a href=\"https://defector.com/finally-a-grocery-cart-that-can-save-me-from-the-horror-of-an-ad-free-moment-of-existence\">Finally, A Grocery Cart That Can Save Me From The Horror Of An Ad-Free Moment Of Existence | Defector</a>:</p>\n<blockquote>\n<p>This is one of those new technologies that&rsquo;s useful primarily as a viewfinder on a dismal present and a future determined to be even more miserable. Nobody anywhere will like the smart carts. Nobody, anywhere, will find them not-obnoxious. Everybody who does more than a couple of moments of thinking about it will be horrified by the idea of humanity digging gigantic devastating holes in the ailing planet and mining out its contents for the purpose of putting tablet computers onto grocery carts so that they can perform a service repulsive to literally everyone. Nobody—nobody nobody nobody!—wants to live in a society characterized by inescapable omnipresent advertising for consumer products; no one yet born has yearned to have video advertisements take up ever more of their field of vision.</p>\n</blockquote>\n<p>This is one of those paragraphs that I wish I had written</p>\n",
				"content_text": "\n\n[Finally, A Grocery Cart That Can Save Me From The Horror Of An Ad-Free Moment Of Existence | Defector](https://defector.com/finally-a-grocery-cart-that-can-save-me-from-the-horror-of-an-ad-free-moment-of-existence):\n\n> This is one of those new technologies that's useful primarily as a viewfinder on a dismal present and a future determined to be even more miserable. Nobody anywhere will like the smart carts. Nobody, anywhere, will find them not-obnoxious. Everybody who does more than a couple of moments of thinking about it will be horrified by the idea of humanity digging gigantic devastating holes in the ailing planet and mining out its contents for the purpose of putting tablet computers onto grocery carts so that they can perform a service repulsive to literally everyone. Nobody—nobody nobody nobody!—wants to live in a society characterized by inescapable omnipresent advertising for consumer products; no one yet born has yearned to have video advertisements take up ever more of their field of vision.\n\nThis is one of those paragraphs that I wish I had written\n",
				"date_published": "2024-01-10T22:13:01+00:00",
				"url": "https://technovia.co.uk/2024/01/10/finally-a-grocery.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/12/09/pluralistic-if-buying.html",
				"title": "Pluralistic “If buying isn’t owning, piracy isn’t stealing”",
				"content_html": "<p><a href=\"https://pluralistic.net/2023/12/08/playstationed/\">Pluralistic: “If buying isn’t owning, piracy isn’t stealing” (08 Dec 2023) – Pluralistic: Daily links from Cory Doctorow</a>:</p>\n<blockquote>\n<p>In Poland, a team of security researchers at the OhMyHack conference just presented their teardown of the anti-repair features in NEWAG Impuls locomotives. NEWAG boobytrapped their trains to try and detect if they&rsquo;ve been independently serviced, and to respond to any unauthorized repairs by bricking themselves</p>\n</blockquote>\n<p>If you ever needed to see an example of quite how insane the &ldquo;IP protection&rdquo; laws are, this is probably it.</p>\n",
				"content_text": "\n\n[Pluralistic: “If buying isn’t owning, piracy isn’t stealing” (08 Dec 2023) – Pluralistic: Daily links from Cory Doctorow](https://pluralistic.net/2023/12/08/playstationed/):\n\n> In Poland, a team of security researchers at the OhMyHack conference just presented their teardown of the anti-repair features in NEWAG Impuls locomotives. NEWAG boobytrapped their trains to try and detect if they've been independently serviced, and to respond to any unauthorized repairs by bricking themselves\n\nIf you ever needed to see an example of quite how insane the \"IP protection\" laws are, this is probably it. \n",
				"date_published": "2023-12-09T22:38:38+00:00",
				"url": "https://technovia.co.uk/2023/12/09/pluralistic-if-buying.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/12/03/the-macbook-pro.html",
				"title": "The MacBook Pro",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>The MacBook Pro 16in which was effectively replaced by my MacBook Air M2 has been sitting in a corner for a while. I had wiped it completely – something that’s a bit of a saga in its own right – and intended to sell it.</p>\n\n<p>The buyer I had in mind wasn’t able to take it as unfortunately, they had some financial mishaps, and I would rather not sell it via eBay or classified. So it has just sat there doing nothing. </p>\n\n<p>I decided to set it up and use it for a while, just to remind myself of what it was like. It’s the last generation of Intel machine, and I bought it not long before the announcement of the M-series chips. Although it was the lowest-end of 16in MacBook Pro, it’s still a pretty good computer and it seemed a shame for it to be doing nothing. </p>\n\n<p>I’m glad I did because it’s reminded me how much I like a big screen laptop. It’s nowhere near as good for either performance or battery life as the Air, but it’s still more than fast enough for everything I need to do. And as I am unlikely to stray far from the house with it I don’t need to worry too much about the battery. </p>\n\n<p>Now I just have to think about a name for it because the default “Ian’s MacBook Pro” seems a little bit soulless. </p>\n\n<h2>Installing Brew</h2>\n\n<p>Whenever I get a new Mac or resurrect an old one, I start from scratch rather than reinstall from a backup. This lets me work out which applications I actually need. Because I like to try out many applications, I end up with a lot of software on my machines which I don’t actually use much.</p>\n\n<p>The days when this mattered from the perspective of system maintenance are long gone. Most applications are spraying extensions, libraries, or even (lord help us) DLLs all over your system. Even Linux has self-contained application installs now, thanks to technologies like AppImage, Flatpak and Snap. </p>\n\n<p>But it’s still a waste of disk space and feels inelegant, so I set everything up with a clean slate and only install when I like using. </p>\n\n<p>One thing that always gets installed on any Mac is <a href=\"https://brew.sh\">Brew</a>, the package manager, which is the de facto standard for installing Unix apps on an Apple computer. macOS is, of course, based on Unix, but the default set up doesn’t include the kind of software which usually comes as standard – utilities like ffmpeg, for example. </p>\n\n<p>You can install them, though, and Brew makes is easy. It’s a command line tool which works in the same way as a regular Linux package manager, like DNF on Fedora or APT on Debian-derivatives. Once you have installed Brew using a single line of commands, you can type <code>brew install</code> and the name of the software you want, and it will do all the installation you need. </p>\n\n<p>Brew lets you fill the holes which Apple has left. For example, the first thing I install with it is <code>wget</code>, which isn’t part of the standard macOS and which I find very useful. I also add <code>yt-dlp</code> so I can download video from YouTube and other services, as well as <code>get_iplayer</code> to tap into the BBC’s archives. </p>\n\n<p>There’s a lot more you can do with Brew, and if you are used to the command line I recommend it. </p>\n",
				"date_published": "2023-12-03T11:32:23+00:00",
				"url": "https://technovia.co.uk/2023/12/03/the-macbook-pro.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/11/29/open-extensions-on.html",
				"title": "Open extensions on Firefox for Android debut December 14 (but you can get a sneak peek today) | Mozilla Add-ons Community Blog",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p><a href=\"https://blog.mozilla.org/addons/2023/11/28/open-extensions-on-firefox-for-android-debut-december-14-but-you-can-get-a-sneak-peek-today/\">Open extensions on Firefox for Android debut December 14 (but you can get a sneak peek today)</a>:</p>\n<blockquote>\n<p>Starting December 14, 2023, extensions marked as Android compatible on addons.mozilla.org (AMO) will be openly available to Firefox for Android users.</p>\n</blockquote>\n<p>But not of course for iOS, because Apple doesn’t allow companies to use any rendering engine other than Safari’s webview. And Apple also <strong>hates</strong> the idea of extensions that aren’t themselves applications, so don’t expect them to make the lives of extension developers easy once the <a href=\"https://www.techspot.com/news/94625-leak-suggests-eu-fight-ios-webkit-dominance.html\">EU forces them to open things up a little</a>. </p>\n",
				"date_published": "2023-11-29T21:25:38+00:00",
				"url": "https://technovia.co.uk/2023/11/29/open-extensions-on.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/11/07/john-g-on.html",
				"title": "John G on Monica Chin's review of the Surface Laptop Go 3",
				"content_html": "<p><a href=\"https://daringfireball.net/linked/2023/11/06/chin-microsoft-surface-why-does-it-exist\">Daring Fireball: Monica Chin on the Microsoft Surface Laptop Go 3: &lsquo;Why Does This Exist?&rsquo;</a>:</p>\n<blockquote>\n<p>A $999 laptop that maxes out at 256 GB of storage and has a 1536 × 1024 display — yeah, I’m wondering why this exists in 2023, too. And I’m no longer wondering why Panos Panay left Microsoft for Amazon.</p>\n</blockquote>\n<p>The <a href=\"https://www.apple.com/shop/buy-mac/macbook-air/13-inch-m1\">$999 MacBook Air</a> has 256Gb of storage, 8Gb of RAM, and a three year old processor. I&rsquo;m kind of wondering why that exists in 2023, too.</p>\n<p>Not to say that the Surface Laptop 3 is any good &ndash; it isn&rsquo;t &ndash; but Microsoft isn&rsquo;t the only company that has some bizarre pricing at the &ldquo;low&rdquo; end of its laptop range.</p>\n",
				"content_text": "\n[Daring Fireball: Monica Chin on the Microsoft Surface Laptop Go 3: 'Why Does This Exist?'](https://daringfireball.net/linked/2023/11/06/chin-microsoft-surface-why-does-it-exist):\n\n> A $999 laptop that maxes out at 256 GB of storage and has a 1536 × 1024 display — yeah, I’m wondering why this exists in 2023, too. And I’m no longer wondering why Panos Panay left Microsoft for Amazon.\n\nThe [$999 MacBook Air](https://www.apple.com/shop/buy-mac/macbook-air/13-inch-m1) has 256Gb of storage, 8Gb of RAM, and a three year old processor. I'm kind of wondering why that exists in 2023, too.\n\nNot to say that the Surface Laptop 3 is any good -- it isn't -- but Microsoft isn't the only company that has some bizarre pricing at the \"low\" end of its laptop range. \n",
				"date_published": "2023-11-07T16:07:49+00:00",
				"url": "https://technovia.co.uk/2023/11/07/john-g-on.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/11/05/on-steven-sinofskys.html",
				"title": "On Steven Sinofsky's post on regulating AI",
				"content_html": "<p><a href=\"https://hardcoresoftware.learningbyshipping.com/p/211-regulating-ai-by-executive-order?r=evw8&amp;utm_campaign=post&amp;utm_medium=web\">Regulating AI by Executive Order is the Real AI Risk</a>:</p>\n<blockquote>\n<p>The President’s Executive Order on Artificial Intelligence is a premature and pessimistic political solution to unknown technical problems and a clear case of regulatory capture at a time when the world would be best served by optimism and innovation</p>\n</blockquote>\n<p>Sinofsky&rsquo;s response is fairly typical of the AI boosters, and as always, it fails to understand the point of regulation. And in particular it fails to understand why an executive order is entirely the correct approach at this point.</p>\n<p>Regulation exists so that we gain the benefits of something while ameliorating the risks. To use an area that probably makes sense to Americans, we regulate guns, so we get the benefits of them (personal protection, national security) while avoiding the dangers (everyone having a gun tends to lead to lots and plenty of gun deaths).</p>\n<p>AI is the same: we should regulate AI to ameliorate the dangers of it. Now, those dangers aren&rsquo;t Terminators stomping around the world with machine guns. They are, instead, things like racial discrimination because of an intrinsic bias of algorithms. It&rsquo;s looking at the implications for privacy of generative AI being able to perfectly impersonate a person. It&rsquo;s the legal questions of accountability – if an AI makes a major error which leads to death, for example, who exactly is responsible?</p>\n<p>But hey, I guess <a href=\"https://www.nytimes.com/2023/10/26/opinion/marc-andreessen-reactionary-futurism.html\">tech ethics is the enemy</a>, right?</p>\n<p>So why an EO? In part, I think the AI boosters only have themselves to blame. You can&rsquo;t go around saying that AI is the most transformative technology since the invention of the PC and stoking the stock markets by claiming the impact will all be in the next couple of years and not be surprised if a government uses the tools it has to act expeditiously. Silicon Valley types constantly laugh at the slowness of the Federal government. Complaining when it does something quickly seems a bit rich. “Move fast and break stuff” sure – but not when it&rsquo;s their gigantic wealth that might be the thing that gets broken.</p>\n<p>Sinofsky also highlights the nay-sayers of the past, including posting some pictures of books which drew attention to the dangers of computers. The problem is some of those books are turning out to be correct: David Burnham&rsquo;s <em>The Rise of the Computer State</em> looks pretty prescient in a world of ubiquitous surveillance where governments are encouraging police forces to make <a href=\"https://www.theguardian.com/technology/2023/oct/29/uk-police-urged-to-double-use-of-facial-recognition-software\">more use of facial recognition software</a>, even though <a href=\"https://www.bbc.co.uk/news/uk-wales-65214494\">it discriminates against minorities</a> because it finds it hard to recognise black faces. Arthur R. Miller may have been on to something, too, when he titled his book <em>The Assault on Privacy</em>.</p>\n<p>Sinofsky gets to the heart of what ails him in a single paragraph:</p>\n<blockquote>\n<p>Section I of the EO says it all right up front. This is not a document about innovation. It is about stifling innovation. It is not about fostering competition or free markets but about controlling them a priori. It is not about regulating known problems but preventing problems that don’t yet exist from existing.</p>\n</blockquote>\n<p>To which I would respond: &ldquo;great! It&rsquo;s about time!&rdquo;</p>\n<p>There is a myth in Silicon Valley that innovation is somehow an unalloyed good which must always be protected and should never be regulated, lest we stop some world-shaking discovery. It doesn&rsquo;t take 20 seconds of thinking – or even any understanding of history – to see that&rsquo;s not true. Yes, experimentation is how we learn, how we discover new things which benefit us all. But there are no spheres of knowledge outside possibly the humanities where that is completely unregulated. If you want to do nuclear research, good look with getting a permit to run your experimental reactor in the middle of a city. If you would like to do experimental chemistry, you&rsquo;re going to be on the wrong side of the law if you do it in your garage.</p>\n<p>All of those things “stifle innovation”. All of them are entirely justified. Given the world-changing hype – created by technology business people – around AI, they really should get used to a little stifling too.</p>\n<p>As for the idea that this is “preventing product(s) that don&rsquo;t exist from existing”… that is precisely what we pay our taxes to do. We spend billions on defence to prevent the problem of someone dropping big bombs on our cities. We pay for education, so we won&rsquo;t have the problem of a stupid population which <a href=\"https://en.wikipedia.org/wiki/Donald_Trump\">votes in a charlatan</a> in the future (why do you think the far right hates education?)</p>\n<p>Good business leaders talk all the time about how proactive action prevents costly issues in the future. They scan horizons, and act decisively and early to make sure their businesses survive. The idea that the government should only <em>react</em>, especially when that&rsquo;s usually too late, is just bizarre.</p>\n<p>At one point, Sinofsky&rsquo;s sings the praises of science fiction:</p>\n<blockquote>\n<p>The best, enduring, and most thoughtful writers who most eloquently expressed the fragility and risks of technology also saw technology as the answer to forward progress. They did not seek to pre-regulate the problems but to innovate our way out of problems. In all cases, we would not have gotten to the problems on display without the optimism of innovation. There would be no problem with an onboard computer if the ship had already not traveled the far reaches of the universe.</p>\n</blockquote>\n<p>It&rsquo;s a mark of the Silicon Valley mind-set that he appears to forget the understandable point that <em>this was all made up stuff.</em> 2001 wasn&rsquo;t real. Star Trek was not real.</p>\n<p>Sinofsky then spends some time arguing that the government isn&rsquo;t “compelled” to act, as AI is actually not moving that quickly:</p>\n<blockquote>\n<p>No matter how fast you believe AI is advancing, it is not advancing at the exponential rates we saw in microprocessors as we all know today as Moore’s Law or the growth of data storage that made database technology possible, or the number of connected nodes on the internet starting in 1994 due to the WWW and browser.</p>\n</blockquote>\n<p>All well and good, but not true: <a href=\"https://www.computerweekly.com/news/252475371/Stanford-University-finds-that-AI-is-outpacing-Moores-Law\">a Stanford study from 2019</a> found that AI computational power was advancing <em>faster</em> than processor development, and that was before the massive boost from the current AI frenzy. <a href=\"https://www.alger.com/Pages/OnTheMoney.aspx?pageLabel=AOM316\">Intel has noted the speed</a> at which AI programs can “train” themselves doubles every four months, compared to the 24 months that Moore&rsquo;s Law predicted for processor speed.</p>\n<p>Towards the end, of course, Sinofsky lapses into Andreessen-style gibberish:</p>\n<blockquote>\n<p>The Order is about restricting the “We” to the government and constraining the “We” that is the people. Let that sink in.</p>\n</blockquote>\n<p>Making “the people” synonymous with &ldquo;extremely rich billionaires and their companies” is, of course, one of the tricks that the rich play again and again and again. AI is being created to enrich the already rich. It requires resources in computing power, which means my only option of accessing it is to rent time on someone else&rsquo;s computer. It reinforces <a href=\"https://doctorow.medium.com/yanis-varoufakiss-technofeudalism-what-killed-capitalism-cb36d44c78f9\">technofeudalism</a>. Of course, Silicon Valley, which wants to make sure all of us pays a tithe to them, loves it.</p>\n<p>It&rsquo;s time that we have some assertion of democratic control over the forces that shape our lives. The Silicon Valley fat cats don&rsquo;t like it. That, on its own, tells me that regulating AI is probably a good thing.</p>\n",
				"content_text": "[Regulating AI by Executive Order is the Real AI Risk](https://hardcoresoftware.learningbyshipping.com/p/211-regulating-ai-by-executive-order?r=evw8&utm_campaign=post&utm_medium=web):\n\n> The President’s Executive Order on Artificial Intelligence is a premature and pessimistic political solution to unknown technical problems and a clear case of regulatory capture at a time when the world would be best served by optimism and innovation\n\nSinofsky's response is fairly typical of the AI boosters, and as always, it fails to understand the point of regulation. And in particular it fails to understand why an executive order is entirely the correct approach at this point.\n\nRegulation exists so that we gain the benefits of something while ameliorating the risks. To use an area that probably makes sense to Americans, we regulate guns, so we get the benefits of them (personal protection, national security) while avoiding the dangers (everyone having a gun tends to lead to lots and plenty of gun deaths). \n\nAI is the same: we should regulate AI to ameliorate the dangers of it. Now, those dangers aren't Terminators stomping around the world with machine guns. They are, instead, things like racial discrimination because of an intrinsic bias of algorithms. It's looking at the implications for privacy of generative AI being able to perfectly impersonate a person. It's the legal questions of accountability – if an AI makes a major error which leads to death, for example, who exactly is responsible?\n\nBut hey, I guess [tech ethics is the enemy](https://www.nytimes.com/2023/10/26/opinion/marc-andreessen-reactionary-futurism.html), right? \n\nSo why an EO? In part, I think the AI boosters only have themselves to blame. You can't go around saying that AI is the most transformative technology since the invention of the PC and stoking the stock markets by claiming the impact will all be in the next couple of years and not be surprised if a government uses the tools it has to act expeditiously. Silicon Valley types constantly laugh at the slowness of the Federal government. Complaining when it does something quickly seems a bit rich. “Move fast and break stuff” sure – but not when it's their gigantic wealth that might be the thing that gets broken. \n\nSinofsky also highlights the nay-sayers of the past, including posting some pictures of books which drew attention to the dangers of computers. The problem is some of those books are turning out to be correct: David Burnham's *The Rise of the Computer State* looks pretty prescient in a world of ubiquitous surveillance where governments are encouraging police forces to make [more use of facial recognition software](https://www.theguardian.com/technology/2023/oct/29/uk-police-urged-to-double-use-of-facial-recognition-software), even though [it discriminates against minorities](https://www.bbc.co.uk/news/uk-wales-65214494) because it finds it hard to recognise black faces. Arthur R. Miller may have been on to something, too, when he titled his book *The Assault on Privacy*.\n\nSinofsky gets to the heart of what ails him in a single paragraph:\n\n> Section I of the EO says it all right up front. This is not a document about innovation. It is about stifling innovation. It is not about fostering competition or free markets but about controlling them a priori. It is not about regulating known problems but preventing problems that don’t yet exist from existing.\n\nTo which I would respond: \"great! It's about time!\"\n\nThere is a myth in Silicon Valley that innovation is somehow an unalloyed good which must always be protected and should never be regulated, lest we stop some world-shaking discovery. It doesn't take 20 seconds of thinking – or even any understanding of history – to see that's not true. Yes, experimentation is how we learn, how we discover new things which benefit us all. But there are no spheres of knowledge outside possibly the humanities where that is completely unregulated. If you want to do nuclear research, good look with getting a permit to run your experimental reactor in the middle of a city. If you would like to do experimental chemistry, you're going to be on the wrong side of the law if you do it in your garage. \n\nAll of those things “stifle innovation”. All of them are entirely justified. Given the world-changing hype – created by technology business people – around AI, they really should get used to a little stifling too.\n\nAs for the idea that this is “preventing product(s) that don't exist from existing”… that is precisely what we pay our taxes to do. We spend billions on defence to prevent the problem of someone dropping big bombs on our cities. We pay for education, so we won't have the problem of a stupid population which [votes in a charlatan](https://en.wikipedia.org/wiki/Donald_Trump) in the future (why do you think the far right hates education?) \n\nGood business leaders talk all the time about how proactive action prevents costly issues in the future. They scan horizons, and act decisively and early to make sure their businesses survive. The idea that the government should only *react*, especially when that's usually too late, is just bizarre.\n\nAt one point, Sinofsky's sings the praises of science fiction:\n\n> The best, enduring, and most thoughtful writers who most eloquently expressed the fragility and risks of technology also saw technology as the answer to forward progress. They did not seek to pre-regulate the problems but to innovate our way out of problems. In all cases, we would not have gotten to the problems on display without the optimism of innovation. There would be no problem with an onboard computer if the ship had already not traveled the far reaches of the universe.\n\nIt's a mark of the Silicon Valley mind-set that he appears to forget the understandable point that *this was all made up stuff.* 2001 wasn't real. Star Trek was not real. \n\nSinofsky then spends some time arguing that the government isn't “compelled” to act, as AI is actually not moving that quickly:\n\n> No matter how fast you believe AI is advancing, it is not advancing at the exponential rates we saw in microprocessors as we all know today as Moore’s Law or the growth of data storage that made database technology possible, or the number of connected nodes on the internet starting in 1994 due to the WWW and browser.\n\nAll well and good, but not true: [a Stanford study from 2019](https://www.computerweekly.com/news/252475371/Stanford-University-finds-that-AI-is-outpacing-Moores-Law) found that AI computational power was advancing *faster* than processor development, and that was before the massive boost from the current AI frenzy. [Intel has noted the speed](https://www.alger.com/Pages/OnTheMoney.aspx?pageLabel=AOM316) at which AI programs can “train” themselves doubles every four months, compared to the 24 months that Moore's Law predicted for processor speed. \n\nTowards the end, of course, Sinofsky lapses into Andreessen-style gibberish:\n\n> The Order is about restricting the “We” to the government and constraining the “We” that is the people. Let that sink in.\n\nMaking “the people” synonymous with \"extremely rich billionaires and their companies” is, of course, one of the tricks that the rich play again and again and again. AI is being created to enrich the already rich. It requires resources in computing power, which means my only option of accessing it is to rent time on someone else's computer. It reinforces [technofeudalism](https://doctorow.medium.com/yanis-varoufakiss-technofeudalism-what-killed-capitalism-cb36d44c78f9). Of course, Silicon Valley, which wants to make sure all of us pays a tithe to them, loves it. \n\nIt's time that we have some assertion of democratic control over the forces that shape our lives. The Silicon Valley fat cats don't like it. That, on its own, tells me that regulating AI is probably a good thing. \n",
				"date_published": "2023-11-05T12:28:47+00:00",
				"url": "https://technovia.co.uk/2023/11/05/on-steven-sinofskys.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/11/03/importing-apple-notes.html",
				"title": "Importing Apple Notes into Obsidian is now easy",
				"content_html": "<p><a href=\"https://www.macstories.net/stories/obsidians-importer-plugin-lets-you-move-your-apple-notes-to-any-note-taking-app-that-supports-markdown/\">Obsidian&rsquo;s Importer Plugin Lets You Move Your Apple Notes to Any Note-Taking App That Supports Markdown - MacStories</a>:</p>\n<blockquote>\n<p>Apple Notes doesn’t have an export option. Instead, as Obsidian’s blog post on the Importer plugin update explains, it stores your notes in a local SQLite database. The format isn’t documented, but the developers of the plugin were able to reverse-engineer it to allow users to move notes and their attachments out of Notes and into two folders: one with Markdown versions of your notes and the other with the files attached to your notes. The folder with your notes includes subfolders that match any folders you set up in Notes, too.</p>\n</blockquote>\n<p>This is just outstanding work from the Obsidian team. There are a couple of limitations, mostly that it can&rsquo;t import password protected notes (obviously), but I&rsquo;ve tested it and it worked well.</p>\n<p>Related: undocumented SQLite databases should not be the way that a multi-gazillion dollar corporation is storing valuable data.</p>\n",
				"content_text": "\n[Obsidian's Importer Plugin Lets You Move Your Apple Notes to Any Note-Taking App That Supports Markdown - MacStories](https://www.macstories.net/stories/obsidians-importer-plugin-lets-you-move-your-apple-notes-to-any-note-taking-app-that-supports-markdown/):\n\n> Apple Notes doesn’t have an export option. Instead, as Obsidian’s blog post on the Importer plugin update explains, it stores your notes in a local SQLite database. The format isn’t documented, but the developers of the plugin were able to reverse-engineer it to allow users to move notes and their attachments out of Notes and into two folders: one with Markdown versions of your notes and the other with the files attached to your notes. The folder with your notes includes subfolders that match any folders you set up in Notes, too.\n\nThis is just outstanding work from the Obsidian team. There are a couple of limitations, mostly that it can't import password protected notes (obviously), but I've tested it and it worked well. \n\nRelated: undocumented SQLite databases should not be the way that a multi-gazillion dollar corporation is storing valuable data. \n",
				"date_published": "2023-11-03T10:33:16+00:00",
				"url": "https://technovia.co.uk/2023/11/03/importing-apple-notes.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/11/02/who-would-have.html",
				"title": "Who would have thought Amazon would behave like this?",
				"content_html": "<p><a href=\"https://www.wsj.com/tech/amazon-executives-discussed-how-its-policies-hurt-sellers-ftc-suit-says-863e05c4?mod=followamazon\" title=\"Amazon used Signal to avoid FTC scrutiny\">Amazon deliberately deleted messages to hide dodgy business practices</a>:</p>\n<blockquote>\n<p>The FTC also alleges that Amazon tried to impede its investigation into the company’s business practices. “Amazon executives systematically and intentionally deleted internal communications using the ‘disappearing message’ feature of the Signal messaging app. Amazon prejudicially destroyed more than two years’ worth of such communications—from June 2019 to at least early 2022—despite Plaintiffs’ instructing Amazon not to do so.”</p>\n</blockquote>\n<p>And the answer to the headline is, of course, “anyone that’s been paying attention.</p>\n",
				"content_text": "[Amazon deliberately deleted messages to hide dodgy business practices](https://www.wsj.com/tech/amazon-executives-discussed-how-its-policies-hurt-sellers-ftc-suit-says-863e05c4?mod=followamazon \"Amazon used Signal to avoid FTC scrutiny\"):\n\n> The FTC also alleges that Amazon tried to impede its investigation into the company’s business practices. “Amazon executives systematically and intentionally deleted internal communications using the ‘disappearing message’ feature of the Signal messaging app. Amazon prejudicially destroyed more than two years’ worth of such communications—from June 2019 to at least early 2022—despite Plaintiffs’ instructing Amazon not to do so.”\n\nAnd the answer to the headline is, of course, “anyone that’s been paying attention.\n\n",
				"date_published": "2023-11-02T20:03:52+00:00",
				"url": "https://technovia.co.uk/2023/11/02/who-would-have.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/10/23/doj-probing-teslas.html",
				"title": "DOJ probing Tesla’s EV range cheating",
				"content_html": "<p><a href=\"https://www.theverge.com/2023/10/23/23928563/tesla-doj-ev-range-exaggerate-investigation\">DOJ probing Tesla’s EV range after reports of exaggerated numbers - The Verge</a>:</p>\n<blockquote>\n<p>The US Department of Justice (DOJ) is investigating the range of Tesla’s electric vehicles after reports surfaced that the company was relying on exaggerated numbers.</p>\n</blockquote>\n<blockquote>\n<p>In documents filed with the Securities and Exchange Commission, Tesla said that it had “received requests for information, including subpoenas from the DOJ, regarding certain matters associated with personal benefits, related parties, vehicle range and personnel decisions.”</p>\n</blockquote>\n<p>This follows on from a Reuters&rsquo; report earlier this year, which found Tesla was getting so many complaints about range it was cancelling appointments with its service centres for customers with the problem:</p>\n<blockquote>\n<p>According to <em>Reuters</em>, there was nothing actually wrong with the vehicle’s battery. Rather, Tesla had allegedly created software to rig its driving range estimates to show a rosier picture. This led to thousands of customers seeking service appointments to figure out what was wrong with their vehicles. But because the vehicle was working as intended, Tesla’s diversion team simply canceled all the appointments.</p>\n</blockquote>\n<p>So Tesla created software which gave a false reading of battery range, then when people spotted it, they just canceled any service to them.</p>\n<p>It&rsquo;s worth noting that when VW was caught <a href=\"https://www.bbc.co.uk/news/business-34324772\">cheating on its emissions tests</a> by using a device to check when it was being tested and artificially improving results, it ended up being fined <a href=\"https://en.wikipedia.org/wiki/Volkswagen_emissions_scandal#Settlement\">tens of billions of dollars</a>.</p>\n<p>This isn&rsquo;t on quite that scale, but regulators tend to take a very dim view of cheating customers. It&rsquo;s quite possible this will cost Tesla billions.</p>\n<p>Anyone willing to bet that it will turn out this was done at Elon Musk&rsquo;s insistence? And will that be the final nail in the coffin of his reputation?</p>\n",
				"content_text": "[DOJ probing Tesla’s EV range after reports of exaggerated numbers - The Verge](https://www.theverge.com/2023/10/23/23928563/tesla-doj-ev-range-exaggerate-investigation):\n\n> The US Department of Justice (DOJ) is investigating the range of Tesla’s electric vehicles after reports surfaced that the company was relying on exaggerated numbers.\n\n> In documents filed with the Securities and Exchange Commission, Tesla said that it had “received requests for information, including subpoenas from the DOJ, regarding certain matters associated with personal benefits, related parties, vehicle range and personnel decisions.”\n\nThis follows on from a Reuters' report earlier this year, which found Tesla was getting so many complaints about range it was cancelling appointments with its service centres for customers with the problem:\n\n> According to _Reuters_, there was nothing actually wrong with the vehicle’s battery. Rather, Tesla had allegedly created software to rig its driving range estimates to show a rosier picture. This led to thousands of customers seeking service appointments to figure out what was wrong with their vehicles. But because the vehicle was working as intended, Tesla’s diversion team simply canceled all the appointments.\n\nSo Tesla created software which gave a false reading of battery range, then when people spotted it, they just canceled any service to them. \n\nIt's worth noting that when VW was caught [cheating on its emissions tests](https://www.bbc.co.uk/news/business-34324772) by using a device to check when it was being tested and artificially improving results, it ended up being fined [tens of billions of dollars](https://en.wikipedia.org/wiki/Volkswagen_emissions_scandal#Settlement). \n\nThis isn't on quite that scale, but regulators tend to take a very dim view of cheating customers. It's quite possible this will cost Tesla billions. \n\nAnyone willing to bet that it will turn out this was done at Elon Musk's insistence? And will that be the final nail in the coffin of his reputation?\n",
				"date_published": "2023-10-23T20:15:33+00:00",
				"url": "https://technovia.co.uk/2023/10/23/doj-probing-teslas.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/10/23/china-launches-investigation.html",
				"title": "China launches investigation into iPhone maker Foxconn, says state media",
				"content_html": "<p><a href=\"https://www.ft.com/content/e6abcb86-1c80-4914-ae54-c7df94d7a9e0\">China launches investigation into iPhone maker Foxconn, says state media</a>:</p>\n<blockquote>\n<p>China has launched an investigation into Apple iPhone maker Foxconn over tax and land use, Chinese state media reported on Sunday. The Global Times, citing anonymous sources, said tax authorities inspected Foxconn’s sites in the provinces of Guangdong and Jiangsu and natural resources officials had inspected sites in Henan and Hubei&hellip; The Global Times article quoted an expert saying “Taiwan-funded enterprises, including Foxconn . . . should also assume corresponding social responsibilities and play a positive role in promoting the peaceful development of cross-strait relations”.</p>\n</blockquote>\n<p>This is a <strong>very</strong> big deal and should be keeping Tim Cook awake at night. Effectively, it&rsquo;s a small shot across the bows for Foxconn, a reminder that without the good graces of the Chinese government, it can&rsquo;t exist.</p>\n",
				"content_text": "\n[China launches investigation into iPhone maker Foxconn, says state media](https://www.ft.com/content/e6abcb86-1c80-4914-ae54-c7df94d7a9e0):\n\n> China has launched an investigation into Apple iPhone maker Foxconn over tax and land use, Chinese state media reported on Sunday. The Global Times, citing anonymous sources, said tax authorities inspected Foxconn’s sites in the provinces of Guangdong and Jiangsu and natural resources officials had inspected sites in Henan and Hubei... The Global Times article quoted an expert saying “Taiwan-funded enterprises, including Foxconn . . . should also assume corresponding social responsibilities and play a positive role in promoting the peaceful development of cross-strait relations”.\n\nThis is a **very** big deal and should be keeping Tim Cook awake at night. Effectively, it's a small shot across the bows for Foxconn, a reminder that without the good graces of the Chinese government, it can't exist. \n",
				"date_published": "2023-10-23T13:22:58+00:00",
				"url": "https://technovia.co.uk/2023/10/23/china-launches-investigation.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/10/17/the-new-apple.html",
				"title": "The new Apple Pencil",
				"content_html": "<p>Apple has released a new <a href=\"https://www.apple.com/uk/newsroom/2023/10/apple-introduces-new-apple-pencil-bringing-more-value-and-choice-to-the-lineup/\">Pencil for iPad</a> and it&rsquo;s weird. It looks like the Second Generation Pencil (the one which charges by sticking to the side of the iPad Pro or current Air). And it will attach there. But it won&rsquo;t charge if you do – it charges through a hidden USB-C port via a cable.</p>\n<p>Oh and it&rsquo;s not pressure sensitive, which makes it worse for drawing than the old Pencil which charged via Lightning.</p>\n<p>It is, though, £79 rather than the ONE HUNDRED AND THIRTY NINE POUNDS the second generation Pencil will cost. So that&rsquo;s one thing.</p>\n",
				"content_text": "\nApple has released a new [Pencil for iPad](https://www.apple.com/uk/newsroom/2023/10/apple-introduces-new-apple-pencil-bringing-more-value-and-choice-to-the-lineup/) and it's weird. It looks like the Second Generation Pencil (the one which charges by sticking to the side of the iPad Pro or current Air). And it will attach there. But it won't charge if you do – it charges through a hidden USB-C port via a cable. \n\nOh and it's not pressure sensitive, which makes it worse for drawing than the old Pencil which charged via Lightning. \n\nIt is, though, £79 rather than the ONE HUNDRED AND THIRTY NINE POUNDS the second generation Pencil will cost. So that's one thing.\n",
				"date_published": "2023-10-17T13:39:11+00:00",
				"url": "https://technovia.co.uk/2023/10/17/the-new-apple.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/10/16/marc-andreessens-manifesto.html",
				"title": "Marc Andreessen's manifesto",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p>It would take a far, far longer post than I’m prepared to spend my time writing to go through Marc Andreessen’s “<a href=\"https://a16z.com/the-techno-optimist-manifesto/\">Techno-Optimist Manifesto</a>” paragraph by awful paragraph, but a few points probably won’t go amiss. - If you’re going to approvingly paraphrase “a manifesto of a different time and place”, you might want to check that said manifesto’s author wasn’t <a href=\"https://en.wikipedia.org/wiki/Filippo_Tommaso_Marinetti#Marinetti_and_Fascism\">an early member of Mussolini’s fascist party</a>.</p>\n<p>- Writing “we believe technology is universalist. Technology doesn’t care about your ethnicity, race, religion, national origin, gender, sexuality, political views,” and then, two paragraphs later “We believe America and her allies should be strong and not weak” either shows you have no idea how to write, are being entirely disingenuous, or simply too stupid to think except in blocks of 240 characters. Either way, get an editor to help.</p>\n<p>- If you are going to talk about the Greek notion of <em>arete</em> then having an understanding of its relationship to class in Greek society might be a good idea, too. Aristocrats were assumed, by definition, to be exemplars of <em>arete.</em> It wasn’t something that <em>thetes</em> like me would have.</p>\n<p>- Believing that techno-optimism “is a material philosophy, <em>not</em> a political philosophy” while giving many repeated examples of what even a first year philosophy undergraduate which know was a political philosophy does not make you look smart.</p>\n<p>I could go on – the whole thing is riddled with howlers – but really is there much point?</p>\n<p>Thirty years ago, in a different life, I was a philosophy postgraduate student and taught first year undergraduates their introduction to metaphysics and ethics. In the first time, every time, someone would turn in an essay which read like this, and you would have to patiently explain to them they were going to have to rewrite it or fail, because philosophy does not mean writing down all the random thoughts you had when smoking that bundle of weed the night before the deadline.</p>\n<p>This is the manifesto of an emotionally insecure man having a mid-life crisis as he realises that his life’s work is meaningless and all the gold and treasure he has accumulated will never make him happy. Mid-life crises in men are often surprisingly redolent of the emotional outpouring of pseudo-intellectual silliness that accompany late teenage, that first period of life when boys start to realise they are not the centre of the world and lash out at the injustice of it all.</p>\n<p>Perhaps, then it’s no surprise this reads like it was written by a 14 year old and put on Pastebin. That it was written by a 52 year old with billions of dollars at his disposal says more about the failure of capitalism to imbue life with meaning than Andreessen could possibly imagine.</p>\n<p>EDIT: The first draft of this contained something about A16Z’s investment in Uber. In fact, they passed on Uber. But as if to make the point about the kind of technology which Andreessen believes will save the world as long as we never question it, let’s ask an AI...</p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"Screenshot 2023-10-17 at 08.48.51.png\" src=\"https://technovia.co.uk/uploads/2023/screenshot-2023-10-17-at-08.48.51.png\" alt=\"Screenshot 2023 10 17 at 08 48 51\" width=\"598\" height=\"297\" border=\"0\" /></p>\n",
				"date_published": "2023-10-16T20:39:02+00:00",
				"url": "https://technovia.co.uk/2023/10/16/marc-andreessens-manifesto.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/10/11/publishers-need-to.html",
				"title": "Publishers need to wake up to the truth about Google traffic",
				"content_html": "<p><a href=\"https://searchengineland.com/google-extended-does-not-stop-google-search-generative-experience-from-using-your-sites-content-433058\">Google-Extended does not stop Google Search Generative Experience from using your site&rsquo;s content (searchengineland.com)</a></p>\n<blockquote>\n<p>Google explained that SGE is part of the Google Search experience; it is a search feature and thus it should work as how normal search directives work. “The context is that AI is built into Search, not bolted on, and integral to how Search functions, which is why robots.txt is the control to give web publishers the option to manage access to how their sites are crawled,” Google told us.</p>\n</blockquote>\n<p>I&rsquo;ve been using both Bard and Bing CoPilot a lot lately and the direction is clear: while AI-driven search will link to original sources as references, they are not going to send much traffic your way. The aim is to provide the answer to any query on the results page, not one more click away.</p>\n<p>This has massive implications for publisher traffic, particular for reviews and answers pages which I think are most vulnerable to AI-driven answers. I&rsquo;ve been using CoPilot for purchasing research and it&rsquo;s great. I can start by asking it for, say, laptops under £1000 with good battery life. I can then have a conversation to interrogate more about each product. It&rsquo;s a superior experience to any web page I have ever used for that kind of product research.</p>\n<p>Is it 100% accurate? No &ndash; but neither are a lot of reviews, particularly the kind of &ldquo;best laptop for…&rdquo; top tens that are written to hit the top of product searches on Google.</p>\n<p>But it&rsquo;s not just affiliate: search provides between 40-80% of publisher site traffic. And we have already seen <a href=\"https://gizmodo.com/facebook-traffic-down-algorithm-change-1850549012#:~:text=Clicks%20coming%20from%20Facebook%20have%20been%20in%20decline,fell%20about%2050%25%20from%20summer%20of%20last%20year.\">Facebook traffic, the other biggest referrer, die off</a>.</p>\n<p><strong>Publishers can no longer rely on Facebook and Google for the bulk of their traffic.</strong> The time has past when content strategies should focus on them. Instead, they need to focus on getting a loyal audience which they have direct relationships with. The SEO era is coming to an end, at least for large chunks of traffic.</p>\n",
				"content_text": "\n[Google-Extended does not stop Google Search Generative Experience from using your site's content (searchengineland.com)](https://searchengineland.com/google-extended-does-not-stop-google-search-generative-experience-from-using-your-sites-content-433058)\n\n> Google explained that SGE is part of the Google Search experience; it is a search feature and thus it should work as how normal search directives work. “The context is that AI is built into Search, not bolted on, and integral to how Search functions, which is why robots.txt is the control to give web publishers the option to manage access to how their sites are crawled,” Google told us.\n\nI've been using both Bard and Bing CoPilot a lot lately and the direction is clear: while AI-driven search will link to original sources as references, they are not going to send much traffic your way. The aim is to provide the answer to any query on the results page, not one more click away. \n\nThis has massive implications for publisher traffic, particular for reviews and answers pages which I think are most vulnerable to AI-driven answers. I've been using CoPilot for purchasing research and it's great. I can start by asking it for, say, laptops under £1000 with good battery life. I can then have a conversation to interrogate more about each product. It's a superior experience to any web page I have ever used for that kind of product research.\n\nIs it 100% accurate? No -- but neither are a lot of reviews, particularly the kind of \"best laptop for…\" top tens that are written to hit the top of product searches on Google. \n\nBut it's not just affiliate: search provides between 40-80% of publisher site traffic. And we have already seen [Facebook traffic, the other biggest referrer, die off](https://gizmodo.com/facebook-traffic-down-algorithm-change-1850549012#:~:text=Clicks%20coming%20from%20Facebook%20have%20been%20in%20decline,fell%20about%2050%25%20from%20summer%20of%20last%20year.). \n\n**Publishers can no longer rely on Facebook and Google for the bulk of their traffic.** The time has past when content strategies should focus on them. Instead, they need to focus on getting a loyal audience which they have direct relationships with. The SEO era is coming to an end, at least for large chunks of traffic.\n",
				"date_published": "2023-10-11T09:45:28+00:00",
				"url": "https://technovia.co.uk/2023/10/11/publishers-need-to.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/10/10/github-copilot-costs.html",
				"title": "GitHub Copilot costs more per user than it charges",
				"content_html": "<p><a href=\"https://www.wsj.com/tech/ai/ais-costly-buildup-could-make-early-products-a-hard-sell-bdd29b9f\">Big Tech Struggles to Turn AI Hype Into Profits - WSJ</a>:</p>\n<blockquote>\n<p>Individuals pay $10 a month for the AI assistant. In the first few months of this year, the company was losing on average more than $20 a month per user, according to a person familiar with the figures, who said some users were costing the company as much as $80 a month.</p>\n</blockquote>\n<p>The first stage of the enshittification cycle is often to charge customers less than it costs to run the service, in order to acquire and lock in as many as possible. After that, at some point, you dump on them from a great height.</p>\n",
				"content_text": "\n[Big Tech Struggles to Turn AI Hype Into Profits - WSJ](https://www.wsj.com/tech/ai/ais-costly-buildup-could-make-early-products-a-hard-sell-bdd29b9f):\n\n>Individuals pay $10 a month for the AI assistant. In the first few months of this year, the company was losing on average more than $20 a month per user, according to a person familiar with the figures, who said some users were costing the company as much as $80 a month.\n\nThe first stage of the enshittification cycle is often to charge customers less than it costs to run the service, in order to acquire and lock in as many as possible. After that, at some point, you dump on them from a great height. \n",
				"date_published": "2023-10-10T08:46:20+00:00",
				"url": "https://technovia.co.uk/2023/10/10/github-copilot-costs.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/10/10/the-good-use.html",
				"title": "The good use of ChatGPT for factual writing",
				"content_html": "<p>I&rsquo;m not a huge fan of using ChatGPT for writing, because even leaving aside issues of accuracy, its style is stilted and just the wrong side of formulaic. But there&rsquo;s one area where it really works as a writing assistant: giving you an outline on a topic as a starting point.</p>\n<p>Tell it what you want and what to include, and it will come back with an outline of everything you should cover. It won&rsquo;t be your final structure, but as a place to start and especially if you&rsquo;re a bit stuck and need something to bounce around to fine-tune your idea, it&rsquo;s a really good assistant.</p>\n<p>I&rsquo;ve been thinking a lot about large language models as assistants for human creativity lately, in the context of Steve Jobs&rsquo; old view of computers as &ldquo;a bicycle for the mind&rdquo; and also the Knowledge Navigator video which came later on &ndash; John Sculley&rsquo;s vision of the future of computing. More to come on that&hellip;</p>\n",
				"content_text": "I'm not a huge fan of using ChatGPT for writing, because even leaving aside issues of accuracy, its style is stilted and just the wrong side of formulaic. But there's one area where it really works as a writing assistant: giving you an outline on a topic as a starting point. \r\n\r\nTell it what you want and what to include, and it will come back with an outline of everything you should cover. It won't be your final structure, but as a place to start and especially if you're a bit stuck and need something to bounce around to fine-tune your idea, it's a really good assistant. \r\n\r\nI've been thinking a lot about large language models as assistants for human creativity lately, in the context of Steve Jobs' old view of computers as \"a bicycle for the mind\" and also the Knowledge Navigator video which came later on -- John Sculley's vision of the future of computing. More to come on that...\n",
				"date_published": "2023-10-10T07:19:26+00:00",
				"url": "https://technovia.co.uk/2023/10/10/the-good-use.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/09/26/microsoft-copilot-shows.html",
				"title": "Microsoft 365 Copilot shows you ads. Or does it?",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p>Ask Microsoft 365 Copilot in Windows if it shows you ads, and it gives you a pretty confused answer:</p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"Asking Copilot if it shows ads.png\" src=\"https://technovia.co.uk/uploads/2023/asking-copilot-if-it-shows-ads.png\" alt=\"Asking Copilot if it shows ads\" width=\"376\" height=\"530\" border=\"0\" /></p>\n<p>But ask it a question about the specs of the iPhone 15, and at the bottom of a useful answer you get… what looks suspiciously like an ad:</p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"But here is Copilot showing ads.png\" src=\"https://technovia.co.uk/uploads/2023/but-here-is-copilot-showing-ads.png\" alt=\"But here is Copilot showing ads\" width=\"265\" height=\"600\" border=\"0\" /></p>\n<p>So which is it? does Copilot show you ads or not?</p>\n<p>Perhaps part the answer comes from the fact that, while it’s available in the UK, it’s <strong>not</strong> <a href=\"https://support.microsoft.com/en-gb/windows/welcome-to-copilot-in-windows-675708af-8c16-4675-afeb-85a5a476ccb0\">shipping in the European Economic Area</a> (EEA). No reasons are given for this, but it’s likely that it’s the same “waiting and seeing” about the impact of the provisions of the Digital Services and Digital Markets Acts in the EU as “stopped” Meta from shipping Threads there.</p>\n<p>Which begs the question: what <em>exactly</em> is Microsoft doing with the data that it’s harvesting from your copy of Windows that makes it nervous about the DSA and DMA? Windows has access to every file, every message, every conversation you have on your computer. So what is Copilot doing with it?</p>\n",
				"date_published": "2023-09-26T20:16:49+00:00",
				"url": "https://technovia.co.uk/2023/09/26/microsoft-copilot-shows.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/09/24/in-this-weeks.html",
				
				"content_html": "<p>In this week&rsquo;s Weeknote, I&rsquo;m doing some writing, walking around Sheppey, and being angry about repairability.</p>\n<p><a href=\"https://ianbetteridge.com/2023/09/24/weeknote-sunday-24th-september-2023/\">ianbetteridge.com/2023/09/2&hellip;</a></p>\n",
				"content_text": "In this week's Weeknote, I'm doing some writing, walking around Sheppey, and being angry about repairability. \r\n\r\n[ianbetteridge.com/2023/09/2...](https://ianbetteridge.com/2023/09/24/weeknote-sunday-24th-september-2023/)\n",
				"date_published": "2023-09-24T11:55:47+00:00",
				"url": "https://technovia.co.uk/2023/09/24/in-this-weeks.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/09/22/one-of-these.html",
				
				"content_html": "<p>One of these days I am going to write something about the prophetic nature of Cronenberg&rsquo;s &ldquo;Videodrom&rdquo; and &ldquo;eXistenz&rdquo;.</p>\n",
				"content_text": "One of these days I am going to write something about the prophetic nature of Cronenberg's \"Videodrom\" and \"eXistenz\".\n",
				"date_published": "2023-09-22T10:04:56+00:00",
				"url": "https://technovia.co.uk/2023/09/22/one-of-these.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/09/15/properties-in-obsidian.html",
				"title": "Properties in Obsidian are a game changer",
				"content_html": "<p>I have been an on-again/off-again user of Obsidian for a couple of years and have lately been shifting a lot of my writing work to it, both blogging and fiction. It&rsquo;s an incredibly flexible tool which can be customised to meet your needs.</p>\n<p>Version 1.4 introduces <em>Properties</em>, a new interface for metadata. You have always been able to add metadata to notes in two ways: tags, which are just a hashtag in the next followed immediately by the tag; and as YAML, front-matter which is delineated in the note by existing between two sets of three hyphens.</p>\n<p>But that YAML has always been visible at the top of your note, which felt kind of clunky. Properties builds on this by taking that YAML and hiding it behind a much nicer interface:</p>\n<p><img src=\"https://github.com/obsidianmd/obsidian-api/assets/693981/aea72173-5663-459d-83de-6ff888f6bdd5\" alt=\"property-editor\"></p>\n<p>The nice part is that the data behind this interface is still just YAML delineated by those three dashes at the start of the file, which means it&rsquo;s editable in any text editor. There&rsquo;s no weird database which stores the metadata disconnected from the original file.<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup></p>\n<p>Why is this potentially so useful? Because for writing, it will allow me to stop using Tags for things like statuses. At the moment, I add a tag to define the status of a document. For example, I have tags for &ldquo;Blog/Ideas&rdquo;, &ldquo;Blog/InProgress&rdquo; and so on. In the future, instead of having to use tags I will be able to create a Property called &ldquo;Status&rdquo; and have ones for &ldquo;Ideas&rdquo;, &ldquo;In Progress&rdquo; etc predefined. This means that tags can become what they should be &ndash; a form of topic-based loose categorisation &ndash; rather than a mixed bag of topics and statuses and names and so on.</p>\n<p>I&rsquo;m really looking forward to seeing what extension developers do with Properties, in particular what can be built using the Auto Note Mover plugin which basically runs my writing workflow.</p>\n<div class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\">\n<p>This is one of the things I most love about Obsidian&rsquo;s design philosophy: everything possible lives in the note, and the note is just a plain text file in a folder on your local drive. If Obsidian ever died, all my notes and articles would still be right there, usable in any other text editor. I would lose the functionality which Obsidian adds over the top, but not the underlying data.&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</div>\n",
				"content_text": "\nI have been an on-again/off-again user of Obsidian for a couple of years and have lately been shifting a lot of my writing work to it, both blogging and fiction. It's an incredibly flexible tool which can be customised to meet your needs.\n\nVersion 1.4 introduces *Properties*, a new interface for metadata. You have always been able to add metadata to notes in two ways: tags, which are just a hashtag in the next followed immediately by the tag; and as YAML, front-matter which is delineated in the note by existing between two sets of three hyphens. \n\nBut that YAML has always been visible at the top of your note, which felt kind of clunky. Properties builds on this by taking that YAML and hiding it behind a much nicer interface:\n\n![property-editor](https://github.com/obsidianmd/obsidian-api/assets/693981/aea72173-5663-459d-83de-6ff888f6bdd5)\n\nThe nice part is that the data behind this interface is still just YAML delineated by those three dashes at the start of the file, which means it's editable in any text editor. There's no weird database which stores the metadata disconnected from the original file.[^1]\n\nWhy is this potentially so useful? Because for writing, it will allow me to stop using Tags for things like statuses. At the moment, I add a tag to define the status of a document. For example, I have tags for \"Blog/Ideas\", \"Blog/InProgress\" and so on. In the future, instead of having to use tags I will be able to create a Property called \"Status\" and have ones for \"Ideas\", \"In Progress\" etc predefined. This means that tags can become what they should be -- a form of topic-based loose categorisation -- rather than a mixed bag of topics and statuses and names and so on. \n\nI'm really looking forward to seeing what extension developers do with Properties, in particular what can be built using the Auto Note Mover plugin which basically runs my writing workflow.\n\n[^1]: This is one of the things I most love about Obsidian's design philosophy: everything possible lives in the note, and the note is just a plain text file in a folder on your local drive. If Obsidian ever died, all my notes and articles would still be right there, usable in any other text editor. I would lose the functionality which Obsidian adds over the top, but not the underlying data. \n",
				"date_published": "2023-09-15T11:02:45+00:00",
				"url": "https://technovia.co.uk/2023/09/15/properties-in-obsidian.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/09/07/no-the-uk.html",
				"title": "No, the UK government did not back down on its plans to spy on encrypted messages",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>Many places reported that the British government had seen sense and backed down from its plans to require companies like Apple, Meta and Signal to give them back door access to end to end encrypted messages. Unfortunately, these reports were completely wrong. </p>\n\n<p>All that the government did was acknowledge that Ofcom, the body which would issue notices to companies requiring them to scan their networks, could only do so if it was technically possible – in other words, that it would be pointless to attempt to demand companies do something they physically couldn’t. This is clear in the quote from Lord Stephen Parkinson, the minister responsible, in the <a href=\"https://www.ft.com/content/770e58b1-a299-4b7b-a129-bded8649a43b\">original FT story</a>:</p>\n\n<blockquote>\n<p>“A notice can only be issued where technically feasible and where technology has been accredited as meeting minimum standards of accuracy in detecting only child sexual abuse and exploitation content,” he said.</p>\n</blockquote>\n\n<p>That is a long way from a government retreat. And as it stands, the clauses requiring companies to endanger their users privacy and security remain in the bill. </p>\n\n<p>The government has now confirmed this, with <a href=\"https://www.reuters.com/technology/uk-minister-says-position-encryption-not-changed-2023-09-07/\">Michelle Donelan, the technology minister, saying</a> saying: </p>\n\n<blockquote>\n<p>“We haven’t changed the bill at all… If there was a situation where the mitigations that the social media providers are taking are not enough, and if after further work with the regulator they still can’t demonstrate that they can meet the requirements within the bill, then the conversation about technology around encryption takes place,” she said.</p>\n</blockquote>\n\n<p>But the government is claiming it’s all technologically feasible:</p>\n\n<blockquote>\n<p>She said further work to develop the technology was needed, but added that <em>government-funded research had shown it was possible</em>. (My emphasis)</p>\n</blockquote>\n\n<p>The government is not backing down. It believes it’s possible technically, and <strong>will</strong> attempt to make companies comply. It will do this in secrecy, and it doesn’t give a damn about the privacy or security of the British people. The fight is not over. </p>\n",
				"date_published": "2023-09-07T20:05:09+00:00",
				"url": "https://technovia.co.uk/2023/09/07/no-the-uk.html",
				"tags": ["Technology","Politics"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/09/07/elon-musk-deliberately.html",
				"title": "Elon Musk deliberately sabotaged a Ukrainian attack",
				"content_html": "<!-- raw HTML omitted -->\n<p>As Ukrainian submarine drones strapped with explosives approached the Russian fleet, they “lost connectivity and washed ashore harmlessly,” Isaacson writes.<!-- raw HTML omitted --></p>\n<!-- raw HTML omitted -->\n",
				"content_text": "<p><a href=\"https://edition.cnn.com/2023/09/07/politics/elon-musk-biography-walter-isaacson-ukraine-starlink/index.html\">New Musk biography offers fresh details about the billionaire's Ukraine dilemma | CNN Politics</a>:</p>\n<blockquote>\n<p>Elon Musk secretly ordered his engineers to turn off his company’s Starlink satellite communications network near the Crimean coast last year to disrupt a Ukrainian sneak attack on the Russian naval fleet, according to an excerpt adapted from Walter Isaacson’s new biography of the eccentric billionaire titled “Elon Musk.”\n\nAs Ukrainian submarine drones strapped with explosives approached the Russian fleet, they “lost connectivity and washed ashore harmlessly,” Isaacson writes.</p>\n</blockquote>\n<p>How, exactly is this man not in prison? This is also quite telling:</p>\n<blockquote>\n<p>Gwynne Shotwell, Musk’s president at SpaceX, was livid at Musk’s reversal, according to Isaacson.</p>\n<p>“The Pentagon had a $145 million check ready to hand to me, literally,” Isaacson quotes Shotwell as saying. “Then Elon succumbed to the bullshit on Twitter and to the haters at the Pentagon who leaked the story.”</p>\n</blockquote>\n<p>Musk, like many stupid men, has been radicalised by Twitter into supporting the far right. That includes supporting Putin, the “white knight” who the far right thinks of as the saviour of western civilisation.</p>\n",
				"date_published": "2023-09-07T14:56:29+00:00",
				"url": "https://technovia.co.uk/2023/09/07/elon-musk-deliberately.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/09/05/brexit-making-windows.html",
				"title": "Brexit making Windows worse in the UK",
				"content_html": "<p><a href=\"https://www.theverge.com/2023/9/5/23859537/microsoft-windows-11-default-browser-links-eu-eea-changes\">Tom Warren, for The Verge</a>:</p>\n<blockquote>\n<p>Microsoft will finally stop forcing Windows 11 users in Europe into Edge if they click a link from the Windows Widgets panel or from search results. The software giant has started testing the changes to Windows 11 in recent test builds of the operating system, but the changes are restricted to countries within the European Economic Area (EEA).</p>\n</blockquote>\n<blockquote>\n<p>“In the European Economic Area (EEA), Windows system components use the default browser to open links,” <a href=\"https://blogs.windows.com/windows-insider/2023/08/25/announcing-windows-11-insider-preview-build-23531-dev-channel/\">reads a change note</a> from a Windows 11 test build released to Dev Channel testers last month. I asked Microsoft to comment on the changes and, in particular, why they’re only being applied to EU countries. Microsoft refused to comment.</p>\n</blockquote>\n<p>Of course this isn&rsquo;t happening in the UK: thanks to Brexit, we&rsquo;re not an EEA country, and so you&rsquo;re stuck with Edge opening links from things like widget no matter what browser you choose. Now that&rsquo;s what I call taking back control.</p>\n",
				"content_text": "\n[Tom Warren, for The Verge](https://www.theverge.com/2023/9/5/23859537/microsoft-windows-11-default-browser-links-eu-eea-changes): \n\n>Microsoft will finally stop forcing Windows 11 users in Europe into Edge if they click a link from the Windows Widgets panel or from search results. The software giant has started testing the changes to Windows 11 in recent test builds of the operating system, but the changes are restricted to countries within the European Economic Area (EEA).\n\n>“In the European Economic Area (EEA), Windows system components use the default browser to open links,” [reads a change note](https://blogs.windows.com/windows-insider/2023/08/25/announcing-windows-11-insider-preview-build-23531-dev-channel/) from a Windows 11 test build released to Dev Channel testers last month. I asked Microsoft to comment on the changes and, in particular, why they’re only being applied to EU countries. Microsoft refused to comment.\n\nOf course this isn't happening in the UK: thanks to Brexit, we're not an EEA country, and so you're stuck with Edge opening links from things like widget no matter what browser you choose. Now that's what I call taking back control. \n",
				"date_published": "2023-09-05T20:10:31+00:00",
				"url": "https://technovia.co.uk/2023/09/05/brexit-making-windows.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/09/05/the-anticapitalist-book.html",
				"title": "The anti-capitalist book of fashion",
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9780745346618\">The Anti-Capitalist Book of Fashion</a> by TANSY E. HOSKINS 📚</p>\n<p>I&rsquo;m not exactly someone that knows a lot about fashion, but this is great book about its relationship with capitalism and how the clothes on your back (literally) cost lives and the earth.</p>\n",
				"content_text": "Finished reading: [The Anti-Capitalist Book of Fashion](https://micro.blog/books/9780745346618) by TANSY E. HOSKINS 📚\n\nI'm not exactly someone that knows a lot about fashion, but this is great book about its relationship with capitalism and how the clothes on your back (literally) cost lives and the earth. \n",
				"date_published": "2023-09-05T18:19:00+00:00",
				"url": "https://technovia.co.uk/2023/09/05/the-anticapitalist-book.html",
				"tags": ["Books"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/09/04/finished-reading-do.html",
				"title": "Do Interesting",
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9781914168208\">Do Interesting</a> by Russell Davies 📚</p>\n<p>I absolutely breezed through this, and enjoyed it greatly.</p>\n",
				"content_text": "Finished reading: [Do Interesting](https://micro.blog/books/9781914168208) by Russell Davies 📚\n\nI absolutely breezed through this, and enjoyed it greatly. \n",
				"date_published": "2023-09-04T18:07:36+00:00",
				"url": "https://technovia.co.uk/2023/09/04/finished-reading-do.html",
				"tags": ["Books"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/09/04/its-long-past.html",
				"title": "It's long past time for Apple to stop advertising on Twitter",
				"content_html": "<p><a href=\"https://mashable.com/article/x-twitter-elon-musk-white-supremacist-ad-ban-adl-hashtag\">Mashable</a>:</p>\n<blockquote>\n<p>Over the past 24 hours, the hashtag &ldquo;BanTheADL&rdquo; has been trending on X, the platform formerly known as <a href=\"https://mashable.com/category/twitter\">Twitter</a>. The trending hashtag refers to the Anti-Defamation League, the Jewish anti-extremism civil rights organization.</p>\n</blockquote>\n<blockquote>\n<p>Even more concerning is that X owner <a href=\"https://mashable.com/article/elon-musk-x-twitter-follower-data\">Elon Musk</a> has signaled support for the attacks against the ADL on the platform.</p>\n</blockquote>\n<blockquote>\n<p>Within the same time frame, numerous X users have also reported being served an X-approved advertisement on the platform that promotes white supremacy.</p>\n</blockquote>\n<p>At this point advertising on Twitter is directly extending financial support to neo-Nazis. It&rsquo;s long past time that companies like Apple,<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup> which <a href=\"https://www.reuters.com/technology/amazon-restart-advertising-twitter-platfomer-reporter-2022-12-04/\">resumed advertising on the platform in December 2022, just stopped</a>.</p>\n<p>But it won&rsquo;t, which is finally putting the lie to the idea that the company&rsquo;s leadership team care one iota about about the impact its actions make on the culture of the country which nurtured it. &ldquo;You support rampant anti-semitism on your service? No problem! Here&rsquo;s some money. You explicitly allow transphobic hate speech on the service? That&rsquo;s fine with us! Here, have some more money.&rdquo;</p>\n<p>Apple is very good at taking a stand when it&rsquo;s easy. It refused to carry various small right-wing social platforms on its App Store, because the content moderation policies weren&rsquo;t up to scratch. Meanwhile, Twitter gets a pass despite having no practical control over hate speech and an owner who actively encourages it.</p>\n<p>Should we be considering boycotting Apple and other companies that advertise on Twitter? Let&rsquo;s frame that another way: if you found out that a company was actively funding hate speech, would you want to buy products from them?</p>\n<p>I know I wouldn&rsquo;t.</p>\n<div class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\">\n<p>Why am I picking on Apple here? First because it&rsquo;s the world&rsquo;s biggest company. Second, because unlike, say, Amazon, it makes a great deal of noise about its commitments to societal good, such as privacy and recycling. No one should be surprised if, say, a car company advertised on Twitter. We hold Apple to a higher standard, because at least publicly it holds itself to one.&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</div>\n",
				"content_text": "\n\n[Mashable](https://mashable.com/article/x-twitter-elon-musk-white-supremacist-ad-ban-adl-hashtag):\n\n> Over the past 24 hours, the hashtag \"BanTheADL\" has been trending on X, the platform formerly known as [Twitter](https://mashable.com/category/twitter). The trending hashtag refers to the Anti-Defamation League, the Jewish anti-extremism civil rights organization.\n\n> Even more concerning is that X owner [Elon Musk](https://mashable.com/article/elon-musk-x-twitter-follower-data) has signaled support for the attacks against the ADL on the platform.\n\n> Within the same time frame, numerous X users have also reported being served an X-approved advertisement on the platform that promotes white supremacy.\n\nAt this point advertising on Twitter is directly extending financial support to neo-Nazis. It's long past time that companies like Apple,[^1] which [resumed advertising on the platform in December 2022, just stopped](https://www.reuters.com/technology/amazon-restart-advertising-twitter-platfomer-reporter-2022-12-04/).\n\nBut it won't, which is finally putting the lie to the idea that the company's leadership team care one iota about about the impact its actions make on the culture of the country which nurtured it. \"You support rampant anti-semitism on your service? No problem! Here's some money. You explicitly allow transphobic hate speech on the service? That's fine with us! Here, have some more money.\"\n\nApple is very good at taking a stand when it's easy. It refused to carry various small right-wing social platforms on its App Store, because the content moderation policies weren't up to scratch. Meanwhile, Twitter gets a pass despite having no practical control over hate speech and an owner who actively encourages it. \n\nShould we be considering boycotting Apple and other companies that advertise on Twitter? Let's frame that another way: if you found out that a company was actively funding hate speech, would you want to buy products from them? \n\nI know I wouldn't.\n\n[^1]: Why am I picking on Apple here? First because it's the world's biggest company. Second, because unlike, say, Amazon, it makes a great deal of noise about its commitments to societal good, such as privacy and recycling. No one should be surprised if, say, a car company advertised on Twitter. We hold Apple to a higher standard, because at least publicly it holds itself to one. \n",
				"date_published": "2023-09-04T07:41:09+00:00",
				"url": "https://technovia.co.uk/2023/09/04/its-long-past.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/09/04/keanu-just-cant.html",
				
				"content_html": "<p>Keanu just can&rsquo;t be human. No human being can be this nice.</p>\n<p><a href=\"https://twitter.com/LAPublicLibrary/status/1697994445721846001\">twitter.com/LAPublicL&hellip;</a></p>\n",
				"content_text": "Keanu just can't be human. No human being can be this nice. \n\n[twitter.com/LAPublicL...](https://twitter.com/LAPublicLibrary/status/1697994445721846001)\n",
				"date_published": "2023-09-04T07:10:35+00:00",
				"url": "https://technovia.co.uk/2023/09/04/keanu-just-cant.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/09/03/goddamit-im-listening.html",
				
				"content_html": "<p>Goddamit I&rsquo;m listening to The Kitchen Cabinet and they are talking about cheese and now all I want is cheese.</p>\n",
				"content_text": "Goddamit I'm listening to The Kitchen Cabinet and they are talking about cheese and now all I want is cheese.\n",
				"date_published": "2023-09-03T10:32:44+00:00",
				"url": "https://technovia.co.uk/2023/09/03/goddamit-im-listening.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/09/02/on-the-read.html",
				"title": "On the read later experience in Pocket and Readwise",
				"content_html": "<p><a href=\"https://om.co/2023/09/01/why-do-companies-become-hostile-to-their-customers/\">Om Malik</a> on how the experience in Pocket has declined and his thoughts on Readwise Reader:</p>\n<blockquote>\n<p>To me, Pocket has always been a repository where I save, store, and archive articles I want to read or use for my ongoing research. That’s its value for me. I don’t care much for their “Home Screen” and its recommendations. While it may seem minor, these changes detract from the app’s core purpose, revealing a user-hostile behavior. The changes implemented by Mozilla and Pocket prioritize their interests and haven’t notably improved my user experience.</p>\n</blockquote>\n<blockquote>\n<p>Readwise initially offered a service for saving highlights from various sources — Apple Books, Pocket, Amazon Kindle, Twitter, and even Discord. I appreciated their approach. Then they launched Reader, their own “read-it-later” app. It lets me save articles, highlight text, add notes, enable public links, save YouTube videos (with text captions), and offers other features. Both Readwise and its competitor, Matter, prioritize enhancing the online reading experience. Meanwhile, Pocket seems to be deciding for me what I need.</p>\n</blockquote>\n<p>I switched from Pocket to Readwise Reader when it was in early beta and I couldn&rsquo;t agree more with Om&rsquo;s assessment. Reader feels like it is built from the ground up to just give me a better experience for getting articles into my inbox, working with them, and getting useful information out of them into other tools. Pocket feels more like it wants to keep me within Pocket.</p>\n",
				"content_text": "\n[Om Malik](https://om.co/2023/09/01/why-do-companies-become-hostile-to-their-customers/) on how the experience in Pocket has declined and his thoughts on Readwise Reader:\n\n> To me, Pocket has always been a repository where I save, store, and archive articles I want to read or use for my ongoing research. That’s its value for me. I don’t care much for their “Home Screen” and its recommendations. While it may seem minor, these changes detract from the app’s core purpose, revealing a user-hostile behavior. The changes implemented by Mozilla and Pocket prioritize their interests and haven’t notably improved my user experience.\n\n> Readwise initially offered a service for saving highlights from various sources — Apple Books, Pocket, Amazon Kindle, Twitter, and even Discord. I appreciated their approach. Then they launched Reader, their own “read-it-later” app. It lets me save articles, highlight text, add notes, enable public links, save YouTube videos (with text captions), and offers other features. Both Readwise and its competitor, Matter, prioritize enhancing the online reading experience. Meanwhile, Pocket seems to be deciding for me what I need.\n\nI switched from Pocket to Readwise Reader when it was in early beta and I couldn't agree more with Om's assessment. Reader feels like it is built from the ground up to just give me a better experience for getting articles into my inbox, working with them, and getting useful information out of them into other tools. Pocket feels more like it wants to keep me within Pocket. \n",
				"date_published": "2023-09-02T16:38:54+00:00",
				"url": "https://technovia.co.uk/2023/09/02/on-the-read.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/09/01/apple-explains-why.html",
				"title": "Apple explains why it abandoned iPhone CSAM detection",
				"content_html": "<p><a href=\"https://appleinsider.com/articles/23/08/31/apple-provides-detailed-reasoning-behind-abandoning-iphone-csam-detection?utm_medium=rss\">Apple explains why it abandoned iPhone CSAM detection</a>:</p>\n<blockquote>\n<p>&ldquo;Scanning every user&rsquo;s privately stored iCloud data would create new threat vectors for data thieves to find and exploit,&rdquo; Neuenschwander continued. &ldquo;It would also inject the potential for a slippery slope of unintended consequences. Scanning for one type of content, for instance, opens the door for bulk surveillance and could create a desire to search other encrypted messaging systems across content types.&rdquo;</p>\n</blockquote>\n<blockquote>\n<p>&ldquo;We decided to not proceed with the proposal for a hybrid client-server approach to CSAM detection for iCloud Photos from a few years ago,&rdquo; he finished. &ldquo;We concluded it was not practically possible to implement without ultimately imperiling the security and privacy of our users.&rdquo;</p>\n</blockquote>\n<p>One of the things which is interesting about this is that these are the exact arguments which campaigners against Apple&rsquo;s scanning proposal used at the time – and the company seems to have listened.</p>\n<p>And that Apple has made its reasoning public gives a strong imperative to it not to try the same thing again, which is a good sign for the future.</p>\n",
				"content_text": "\n[Apple explains why it abandoned iPhone CSAM detection](https://appleinsider.com/articles/23/08/31/apple-provides-detailed-reasoning-behind-abandoning-iphone-csam-detection?utm_medium=rss):\n\n> \"Scanning every user's privately stored iCloud data would create new threat vectors for data thieves to find and exploit,\" Neuenschwander continued. \"It would also inject the potential for a slippery slope of unintended consequences. Scanning for one type of content, for instance, opens the door for bulk surveillance and could create a desire to search other encrypted messaging systems across content types.\"\n\n>\"We decided to not proceed with the proposal for a hybrid client-server approach to CSAM detection for iCloud Photos from a few years ago,\" he finished. \"We concluded it was not practically possible to implement without ultimately imperiling the security and privacy of our users.\"\n\nOne of the things which is interesting about this is that these are the exact arguments which campaigners against Apple's scanning proposal used at the time – and the company seems to have listened.\n\nAnd that Apple has made its reasoning public gives a strong imperative to it not to try the same thing again, which is a good sign for the future. \n",
				"date_published": "2023-09-01T07:15:16+00:00",
				"url": "https://technovia.co.uk/2023/09/01/apple-explains-why.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/31/ha-ha-ha.html",
				"title": "Ha ha ha ha nope",
				"content_html": "<p><a href=\"https://www.bloomberg.com/news/articles/2023-08-31/x-plans-to-collect-user-biometric-data-job-and-education-history\">X, Formerly Twitter, Plans to Collect User Biometric Data, Job, Education - Bloomberg</a>:</p>\n<blockquote>\n<p>“Based on your consent, we may collect and use your biometric information for safety, security, and identification purposes,” the company said in its new policy. X doesn’t define what it considers biometric, though other companies have used the term to describe data gleaned from a person’s face, eyes and fingerprints.</p>\n</blockquote>\n<p>Of the many, many companies on this planet that I would not trust with biometric data, &ldquo;X&rdquo; comes pretty much top of the pile.</p>\n",
				"content_text": "\n[X, Formerly Twitter, Plans to Collect User Biometric Data, Job, Education - Bloomberg](https://www.bloomberg.com/news/articles/2023-08-31/x-plans-to-collect-user-biometric-data-job-and-education-history):\n\n> “Based on your consent, we may collect and use your biometric information for safety, security, and identification purposes,” the company said in its new policy. X doesn’t define what it considers biometric, though other companies have used the term to describe data gleaned from a person’s face, eyes and fingerprints.\n\nOf the many, many companies on this planet that I would not trust with biometric data, \"X\" comes pretty much top of the pile. \n",
				"date_published": "2023-08-31T21:01:21+00:00",
				"url": "https://technovia.co.uk/2023/08/31/ha-ha-ha.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/31/the-real-story.html",
				"title": "The Real Story of Elon Musk’s Twitter Takeover",
				"content_html": "<p><a href=\"https://www.wsj.com/tech/elon-musk-twitter-x-takeover-walter-isaacson-5f553fa\">The Real Story of Elon Musk’s Twitter Takeover - WSJ</a>:</p>\n<blockquote>\n<p>The way that Musk blustered into <a href=\"https://www.wsj.com/articles/elon-musk-moves-swiftly-to-put-imprint-on-twitter-after-takeover-11666978716?mod=article_inline\">buying Twitter</a> and renaming it X was a harbinger of the way he now runs it: impulsively and irreverently. It is an addictive playground for him. It has many of the attributes of a school yard, including taunting and bullying. But in the case of Twitter, the clever kids win followers; they don’t get pushed down the steps and beaten, like Musk was as a kid. Owning it would allow him to become king of the school yard.</p>\n</blockquote>\n<p>The whole of this annoyingly paywalled article<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup> is full of absolute zingers which demonstrate quite how unsuited Musk is to owning something like Twitter.</p>\n<blockquote>\n<p>By then, a new ingredient had been added to this cauldron: Musk’s swelling concern with the dangers of what he called the “woke mind virus” that he believed was infecting America. “Unless the woke mind virus, which is fundamentally anti-science, anti-merit, and anti-human in general, is stopped, civilization will never become multiplanetary,” he told me gravely.</p>\n</blockquote>\n<p>This use of &ldquo;multiplanetary&rdquo; isn&rsquo;t a mistake or a metaphor. Musk has bought into the idea that we can wreck this planet and move on to the next, one that&rsquo;s common amongst the Silicon Valley idiocracy.</p>\n<p>And always remember, the personal <strong>is</strong> political:</p>\n<blockquote>\n<p>Musk’s anti-woke sentiments were partly triggered by the decision of his oldest child, Xavier, then 16, to transition. “Hey, I’m transgender, and my name is now Jenna,” she texted the wife of Elon’s brother. “Don’t tell my dad.” When Musk found out, he was generally sanguine, but then Jenna became a fervent Marxist and broke off all relations with him. “She went beyond socialism to being a full communist and thinking that anyone rich is evil,” he says… He blamed it partly on the ideology he felt that Jenna imbibed at Crossroads, the progressive school she attended in Los Angeles. Twitter, he felt, had become infected by a similar mindset that suppressed right-wing and anti-establishment voices.</p>\n</blockquote>\n<p>It&rsquo;s been rumoured for a long time that having a trans child had been an influence on Musk&rsquo;s blatantly transphobic behaviour. This confirms it.</p>\n<p>I am very glad that I no longer have a presence on Twitter.</p>\n<div class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\">\n<p>I&rsquo;m assuming you don&rsquo;t need me to tell you how to get around paywalls.&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</div>\n",
				"content_text": "[The Real Story of Elon Musk’s Twitter Takeover - WSJ](https://www.wsj.com/tech/elon-musk-twitter-x-takeover-walter-isaacson-5f553fa):\n\n> The way that Musk blustered into [buying Twitter](https://www.wsj.com/articles/elon-musk-moves-swiftly-to-put-imprint-on-twitter-after-takeover-11666978716?mod=article_inline) and renaming it X was a harbinger of the way he now runs it: impulsively and irreverently. It is an addictive playground for him. It has many of the attributes of a school yard, including taunting and bullying. But in the case of Twitter, the clever kids win followers; they don’t get pushed down the steps and beaten, like Musk was as a kid. Owning it would allow him to become king of the school yard.\n\nThe whole of this annoyingly paywalled article[^1] is full of absolute zingers which demonstrate quite how unsuited Musk is to owning something like Twitter. \n\n> By then, a new ingredient had been added to this cauldron: Musk’s swelling concern with the dangers of what he called the “woke mind virus” that he believed was infecting America. “Unless the woke mind virus, which is fundamentally anti-science, anti-merit, and anti-human in general, is stopped, civilization will never become multiplanetary,” he told me gravely.\n\nThis use of \"multiplanetary\" isn't a mistake or a metaphor. Musk has bought into the idea that we can wreck this planet and move on to the next, one that's common amongst the Silicon Valley idiocracy.\n\nAnd always remember, the personal **is** political:\n\n> Musk’s anti-woke sentiments were partly triggered by the decision of his oldest child, Xavier, then 16, to transition. “Hey, I’m transgender, and my name is now Jenna,” she texted the wife of Elon’s brother. “Don’t tell my dad.” When Musk found out, he was generally sanguine, but then Jenna became a fervent Marxist and broke off all relations with him. “She went beyond socialism to being a full communist and thinking that anyone rich is evil,” he says… He blamed it partly on the ideology he felt that Jenna imbibed at Crossroads, the progressive school she attended in Los Angeles. Twitter, he felt, had become infected by a similar mindset that suppressed right-wing and anti-establishment voices.\n\nIt's been rumoured for a long time that having a trans child had been an influence on Musk's blatantly transphobic behaviour. This confirms it.\n\nI am very glad that I no longer have a presence on Twitter.\n\n[^1]: I'm assuming you don't need me to tell you how to get around paywalls.\n",
				"date_published": "2023-08-31T20:31:14+00:00",
				"url": "https://technovia.co.uk/2023/08/31/the-real-story.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/31/microsoft-seems-really.html",
				
				"content_html": "<p>Microsoft seems really determined to give more people more reasons to avoid Windows like the plague.</p>\n<p><a href=\"https://www.theverge.com/2023/8/30/23851902/microsoft-bing-popups-windows-11-malware\">www.theverge.com/2023/8/30&hellip;</a></p>\n",
				"content_text": "Microsoft seems really determined to give more people more reasons to avoid Windows like the plague. \n\n[www.theverge.com/2023/8/30...](https://www.theverge.com/2023/8/30/23851902/microsoft-bing-popups-windows-11-malware)\n",
				"date_published": "2023-08-31T15:50:11+00:00",
				"url": "https://technovia.co.uk/2023/08/31/microsoft-seems-really.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/31/btw-if-you.html",
				
				"content_html": "<p>BTW, if you notice that I’m posting a bunch of little links, it’s because I’m going through the backlog of stuff I’ve saved into Raindrop.io which I TOTALLY recommend over Pinboard.</p>\n",
				"content_text": "BTW, if you notice that I’m posting a bunch of little links, it’s because I’m going through the backlog of stuff I’ve saved into Raindrop.io which I TOTALLY recommend over Pinboard. \n",
				"date_published": "2023-08-31T10:28:11+00:00",
				"url": "https://technovia.co.uk/2023/08/31/btw-if-you.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/31/a-rare-betteridges.html",
				
				"content_html": "<p>A rare Betteridge’s Law-breaking headline. Yes. Yes he was.</p>\n<p>(Because of the nature of the content, Snopes has a pass)</p>\n<p><a href=\"https://www.snopes.com/fact-check/was-elon-musk-fired-from-paypal/\">www.snopes.com/fact-chec&hellip;</a></p>\n",
				"content_text": "A rare Betteridge’s Law-breaking headline. Yes. Yes he was. \n\n(Because of the nature of the content, Snopes has a pass)\n\n[www.snopes.com/fact-chec...](https://www.snopes.com/fact-check/was-elon-musk-fired-from-paypal/) \n",
				"date_published": "2023-08-31T10:21:42+00:00",
				"url": "https://technovia.co.uk/2023/08/31/a-rare-betteridges.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/31/this-is-great.html",
				
				"content_html": "<p>This is great: a bunch of primary sources about the early Macintosh. Much reading!</p>\n<p><a href=\"https://web.stanford.edu/dept/SUL/sites/mac/primary/docs/index.html\">web.stanford.edu/dept/SUL/&hellip;</a></p>\n",
				"content_text": "This is great: a bunch of primary sources about the early Macintosh. Much reading!\n\n[web.stanford.edu/dept/SUL/...](https://web.stanford.edu/dept/SUL/sites/mac/primary/docs/index.html) \n",
				"date_published": "2023-08-31T10:06:56+00:00",
				"url": "https://technovia.co.uk/2023/08/31/this-is-great.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/30/i-see-captain.html",
				
				"content_html": "<p>I see Captain Dickhead is at it again</p>\n<p><a href=\"https://www.cnbc.com/2023/08/30/tesla-ordered-by-nhtsa-to-provide-data-on-elon-mode-for-autopilot.html\">www.cnbc.com/2023/08/3&hellip;</a></p>\n",
				"content_text": "I see Captain Dickhead is at it again\r\n\r\n[www.cnbc.com/2023/08/3...](https://www.cnbc.com/2023/08/30/tesla-ordered-by-nhtsa-to-provide-data-on-elon-mode-for-autopilot.html)\n",
				"date_published": "2023-08-30T15:47:12+00:00",
				"url": "https://technovia.co.uk/2023/08/30/i-see-captain.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/21/it-is-always.html",
				
				"content_html": "<p>It is always worth remembering that Steve Jobs could be a nasty piece of work when he wanted to be.</p>\n<p><a href=\"https://twitter.com/TechEmails/status/1422603572814962692\">twitter.com/TechEmail&hellip;</a></p>\n",
				"content_text": "It is always worth remembering that Steve Jobs could be a nasty piece of work when he wanted to be. \n\n[twitter.com/TechEmail...](https://twitter.com/TechEmails/status/1422603572814962692)\n",
				"date_published": "2023-08-21T21:22:10+00:00",
				"url": "https://technovia.co.uk/2023/08/21/it-is-always.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/20/sad-to-hear.html",
				
				"content_html": "<p>Sad to hear about the death of John Warnock, who was a truly great computer scientist. His early contributions to computer graphics included breakthroughs in working out hidden surfaces, plus of course inventing PostScript which changed the world of publishing.</p>\n",
				"content_text": "Sad to hear about the death of John Warnock, who was a truly great computer scientist. His early contributions to computer graphics included breakthroughs in working out hidden surfaces, plus of course inventing PostScript which changed the world of publishing. \n",
				"date_published": "2023-08-20T18:07:09+00:00",
				"url": "https://technovia.co.uk/2023/08/20/sad-to-hear.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/16/this-weather-is.html",
				
				"content_html": "<p>This weather is almost exactly the kind that makes me want to go for a long snooze, all day.</p>\n",
				"content_text": "This weather is almost exactly the kind that makes me want to go for a long snooze, all day. \n",
				"date_published": "2023-08-16T17:50:30+00:00",
				"url": "https://technovia.co.uk/2023/08/16/this-weather-is.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/14/unraveling-the-digital.html",
				"title": "Unraveling the Digital Markets Act",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p>I absolutely loved this post on <a href=\"https://ia.net/topics/unraveling-the-digital-markets-act\">Unraveling the Digital Markets Act</a>: by the team from iA, who also make one of my favourite pieces of software. </p>\n",
				"date_published": "2023-08-14T15:54:37+00:00",
				"url": "https://technovia.co.uk/2023/08/14/unraveling-the-digital.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/14/this-book-sounds.html",
				
				"content_html": "<p>This book sounds right up my street</p>\n<p><a href=\"https://shkspr.mobi/blog/2023/08/book-review-kill-it-with-fire-manage-ageing-computer-systems-by-marianne-bellotti/\">shkspr.mobi/blog/2023&hellip;</a></p>\n",
				"content_text": "This book sounds right up my street \n\n[shkspr.mobi/blog/2023...](https://shkspr.mobi/blog/2023/08/book-review-kill-it-with-fire-manage-ageing-computer-systems-by-marianne-bellotti/)\n",
				"date_published": "2023-08-14T15:51:23+00:00",
				"url": "https://technovia.co.uk/2023/08/14/this-book-sounds.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/14/printer-makers-are.html",
				"title": "Printer makers are evil, part 3422",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p><a href=\"https://www.theregister.com/2023/08/11/judge_denies_hps_request_to/\">Judge denies HP's request to dismiss printer lockdown suiit • The Register</a>:</p>\n<blockquote>\n<p>HP all-in-one printer owners, upset that their devices wouldn't scan or fax when low on ink, were handed a partial win in a northern California court this week after a judge denied HP's motion to dismiss their suit.</p>\n</blockquote>\n<p>This whole story is just a brilliant example of why there is a special circle of hell reserved for printer manufacturers. And of course it’s also exactly the kind of thing that <a href=\"https://pluralistic.net/tag/printers/\">Cory has been railing against for years</a>. Software locks to prevent you doing things with a device you bought outright are evil. </p>\n",
				"date_published": "2023-08-14T15:19:05+00:00",
				"url": "https://technovia.co.uk/2023/08/14/printer-makers-are.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/14/finished-reading-the.html",
				"title": "The Centauri Device",
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9780575088054\">The Centauri Device</a> by M. John Harrison 📚</p>\n<p>I first read this when I was about ten years old and I’ve loved Harrison’s work ever since. It showed me that SF could be something different, that spaceships didn’t have to mean macho hero figures. MJH doesn’t like it, but I do.</p>\n",
				"content_text": "Finished reading: [The Centauri Device](https://micro.blog/books/9780575088054) by M. John Harrison 📚\n\nI first read this when I was about ten years old and I’ve loved Harrison’s work ever since. It showed me that SF could be something different, that spaceships didn’t have to mean macho hero figures. MJH doesn’t like it, but I do. \n",
				"date_published": "2023-08-14T11:42:15+00:00",
				"url": "https://technovia.co.uk/2023/08/14/finished-reading-the.html",
				"tags": ["Books"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/12/downloading-all-of.html",
				
				"content_html": "<p>Downloading all of the music I have bought from iTunes and I am left with some deeply disturbing questions. Such as &ldquo;when did I buy &rsquo;the best of the Wurzels&rsquo;&rdquo;?</p>\n",
				"content_text": "Downloading all of the music I have bought from iTunes and I am left with some deeply disturbing questions. Such as \"when did I buy 'the best of the Wurzels'\"?\n",
				"date_published": "2023-08-12T09:14:35+00:00",
				"url": "https://technovia.co.uk/2023/08/12/downloading-all-of.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/12/am-i-the.html",
				
				"content_html": "<p>Am I the only Mac user who really doesn&rsquo;t like Magsafe? It constantly gets small particles of grit in it, which stop it making a proper connection, and it&rsquo;s too easy to knock out. Why not just give me another sodding USB-C port (which is what it basically is)?</p>\n",
				"content_text": "Am I the only Mac user who really doesn't like Magsafe? It constantly gets small particles of grit in it, which stop it making a proper connection, and it's too easy to knock out. Why not just give me another sodding USB-C port (which is what it basically is)?\n",
				"date_published": "2023-08-12T08:21:36+00:00",
				"url": "https://technovia.co.uk/2023/08/12/am-i-the.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/09/goddammit-people-dont.html",
				
				"content_html": "<p>Goddammit people don’t make me buy Baldur’s Gate 3</p>\n",
				"content_text": "Goddammit people don’t make me buy Baldur’s Gate 3\n",
				"date_published": "2023-08-09T14:26:41+00:00",
				"url": "https://technovia.co.uk/2023/08/09/goddammit-people-dont.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/07/suspect-charged-in.html",
				"title": "Suspect charged in hate-motivated stabbing in Canada university gender issues class",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p><a href=\"https://www.theguardian.com/world/2023/jun/29/canada-stabbing-attack-university-waterloo-gender-issues-class\">Suspect charged in hate-motivated stabbing in Canada university gender issues class | Canada | The Guardian</a>:</p>\n<blockquote>\n<p>A suspect has been charged in the stabbing of a professor and two students during a class on gender issues at Canada’s University of Waterloo in what police are calling a hate-motivated attack...  “The accused targeted a gender studies class and investigators believe this was a hate-motivated incident related to gender expression and gender identity,” Waterloo police said in a statement on Wednesday.</p>\n</blockquote>\n<p>I'm shocked, shocked i tell you, that the stabbing of a professor teaching a class on gender has turned out to be a hate crime. Silence, of course, from the likes of Kathleen Stock and the other specialists in complaining about how they're being “oppressed\" for their so-called gender critical views. And silence from the right wing “academic freedom” brigade. </p>\n",
				"date_published": "2023-08-07T09:53:11+00:00",
				"url": "https://technovia.co.uk/2023/08/07/suspect-charged-in.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/06/opinionated-record-shops.html",
				"title": "Opinionated record shops",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p><a href=\"https://www.gyford.com/phil/writing/2023/08/06/weeknotes/\">w/e 2023-08-06 (Phil Gyford’s website)</a>:</p>\n<blockquote>\n<p>My only specific memory of shopping in Revolver was going in to buy a ticket to see The Wedding Present play at The Studio in 1991. I asked the guy behind the counter for one and, as he reached for the book or box or whatever, in which they kept tickets, he said with a look of distaste, “Well, I suppose Buffalo Tom are supporting.” It was that kind of place.</p>\n</blockquote>\n<p>There is no better thing on this earth than a record shop (or book store) with an <em>opinion about what’s good.</em> </p>\n",
				"date_published": "2023-08-06T20:00:17+00:00",
				"url": "https://technovia.co.uk/2023/08/06/opinionated-record-shops.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/01/billionaire-investor-threatens.html",
				"title": "Billionaire investor threatens to pull out of UK amid global outcry at new oil rush",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p><a href=\"https://www.theguardian.com/environment/2023/aug/01/billionaire-investor-threatens-pull-out-uk-global-outcry-oil-rush-andrew-forrest\">Billionaire investor threatens to pull out of UK amid global outcry at new oil rush</a>:</p>\n<blockquote>\n<p>“I am a major investor here,” Forrest told Bloomberg News. “If I see this country steering itself over a cliff backing fossil fuel, I am going to start pulling out. I will push my investments over to North America … I must invest where I know I have proper leadership, not leadership which is on a clickbait cycle.”</p>\n</blockquote>\n<p>It’s almost like the Tories still don’t understand that people who aren’t British can read the same newspapers they are pandering to. </p>\n",
				"date_published": "2023-08-01T15:02:36+00:00",
				"url": "https://technovia.co.uk/2023/08/01/billionaire-investor-threatens.html",
				"tags": ["Politics"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/01/gnome-windowing-becoming.html",
				"title": "Gnome windowing becoming more like Apple's Stage Manager?",
				"content_html": "<p>The Gnome foundation, which makes arguably the most popular desktop environment for Linux, is <a href=\"https://blogs.gnome.org/tbernard/2023/07/26/rethinking-window-management/\">experimenting with new windowing models</a>. While there&rsquo;s development work going into better tiling, the more interesting mode is what they&rsquo;re calling &ldquo;Mosaic&rdquo; – and to my eyes, it looks quite a bit like Apple&rsquo;s Stage Manager.</p>\n<p>Here&rsquo;s how they describe how it works:</p>\n<blockquote>\n<p>You open a window, it opens centered on the screen at a size that makes the most sense for the app. For a web browser that might be maximized, for a weather app maybe only 700×500 pixels. As you open more windows, the existing windows move aside to make room for the new ones. If a new window doesn’t fit (e.g. because it wants to be maximized) it moves to its own workspace. If the window layout comes close to filling the screen, the windows are automatically tiled.</p>\n</blockquote>\n<p>That&rsquo;s a pretty good description of how Stage Manager works too, although the details are different. By default when you open a new application in Stage Manager, it opens in its own &ldquo;workspace&rdquo;, with other windows sliding into the shelf on the side. Drag another window in and Stage Manager tries to move windows about so they overlap in the smallest possible way. The Gnome approach looks to be more aggressive about tiling and avoiding overlaps, and although the underlying grid which Stage Manager uses is more relaxed in iPadOS 17 it still feels more &ldquo;gridded&rdquo; than Mosaic.</p>\n<p>It will be really interesting to see where Gnome goes with this – and what the reaction to it will be. Some parts of the Linux community are heavily committed to tiling and see overlapping windows as basically an error in the history of operating systems, while others are more relaxed and open to new ideas.</p>\n",
				"content_text": "The Gnome foundation, which makes arguably the most popular desktop environment for Linux, is [experimenting with new windowing models](https://blogs.gnome.org/tbernard/2023/07/26/rethinking-window-management/). While there's development work going into better tiling, the more interesting mode is what they're calling \"Mosaic\" – and to my eyes, it looks quite a bit like Apple's Stage Manager. \r\n\r\nHere's how they describe how it works:\r\n\r\n>You open a window, it opens centered on the screen at a size that makes the most sense for the app. For a web browser that might be maximized, for a weather app maybe only 700×500 pixels. As you open more windows, the existing windows move aside to make room for the new ones. If a new window doesn’t fit (e.g. because it wants to be maximized) it moves to its own workspace. If the window layout comes close to filling the screen, the windows are automatically tiled.\r\n\r\nThat's a pretty good description of how Stage Manager works too, although the details are different. By default when you open a new application in Stage Manager, it opens in its own \"workspace\", with other windows sliding into the shelf on the side. Drag another window in and Stage Manager tries to move windows about so they overlap in the smallest possible way. The Gnome approach looks to be more aggressive about tiling and avoiding overlaps, and although the underlying grid which Stage Manager uses is more relaxed in iPadOS 17 it still feels more \"gridded\" than Mosaic.\r\n\r\nIt will be really interesting to see where Gnome goes with this – and what the reaction to it will be. Some parts of the Linux community are heavily committed to tiling and see overlapping windows as basically an error in the history of operating systems, while others are more relaxed and open to new ideas. \n",
				"date_published": "2023-08-01T12:55:06+00:00",
				"url": "https://technovia.co.uk/2023/08/01/gnome-windowing-becoming.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/01/why-do-cryptrobros.html",
				
				"content_html": "<p>Why do cryptrobros always have such a lack of imagination about what they spend the money they fraudulently obtain on? Take <a href=\"https://web3isgoinggreat.com/single/sec-goes-after-richard-heart-and-his-projects-hex-pulsechain-and-pulsex\">Richard Heart</a>:</p>\n<blockquote>\n<p>In addition to the unregistered offerings charge, the SEC alleges Heart and PulseChain misappropriated $12.1 million to fund Heart&rsquo;s lavish lifestyle. Among other things, he purchased a McLaren sports car, five luxury watches, and a $4.3 million 555-carat black diamond called &ldquo;Enigma&rdquo;, allegedly using funds from the sale.</p>\n</blockquote>\n<p>It&rsquo;s like a stupid person&rsquo;s wet dream of what being rich means.</p>\n",
				"content_text": "Why do cryptrobros always have such a lack of imagination about what they spend the money they fraudulently obtain on? Take [Richard Heart](https://web3isgoinggreat.com/single/sec-goes-after-richard-heart-and-his-projects-hex-pulsechain-and-pulsex):\n\n>In addition to the unregistered offerings charge, the SEC alleges Heart and PulseChain misappropriated $12.1 million to fund Heart's lavish lifestyle. Among other things, he purchased a McLaren sports car, five luxury watches, and a $4.3 million 555-carat black diamond called \"Enigma\", allegedly using funds from the sale.\n\nIt's like a stupid person's wet dream of what being rich means. \n",
				"date_published": "2023-08-01T09:19:00+00:00",
				"url": "https://technovia.co.uk/2023/08/01/why-do-cryptrobros.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/01/if-ever-anyone.html",
				
				"content_html": "<p>If ever anyone wants to buy me a fancy birthday present, this will do.</p>\n<p><a href=\"https://kareprints.com/products/steve-jobs-1983-on-rainbow\">kareprints.com/products/&hellip;</a></p>\n",
				"content_text": "If ever anyone wants to buy me a fancy birthday present, this will do. \n\n[kareprints.com/products/...](https://kareprints.com/products/steve-jobs-1983-on-rainbow)\n",
				"date_published": "2023-08-01T09:12:58+00:00",
				"url": "https://technovia.co.uk/2023/08/01/if-ever-anyone.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/01/glenn-greenwald-is.html",
				
				"content_html": "<p>Glenn Greenwald is, and always has been, a know-nothing blowhard who overstates everything he comes into contact with. He&rsquo;s not a radical – he actively supports Trump and right-wing interests. This is just the latest example.</p>\n<p><a href=\"https://popehat.substack.com/p/is-following-an-extradition-treaty\">popehat.substack.com/p/is-foll&hellip;</a></p>\n",
				"content_text": "Glenn Greenwald is, and always has been, a know-nothing blowhard who overstates everything he comes into contact with. He's not a radical – he actively supports Trump and right-wing interests. This is just the latest example. \n\n[popehat.substack.com/p/is-foll...](https://popehat.substack.com/p/is-following-an-extradition-treaty)\n",
				"date_published": "2023-08-01T09:10:01+00:00",
				"url": "https://technovia.co.uk/2023/08/01/glenn-greenwald-is.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/01/apple-and-repair.html",
				"title": "Apple and repair",
				"content_html": "<p>I largely agree with <a href=\"https://pxlnv.com/blog/the-fix-is-in/\">Nick Heer&rsquo;s take on Apple&rsquo;s policies on repair</a> – and the criticisms thereof. I don&rsquo;t think Apple goes out of their way to engineer things which are harder to repair, and nor do I believe they deliberately engineer-in stuff which breaks third party repairs. They just build stuff to incredibly tight tolerances and are very specific about parts. <strong>But&hellip;</strong> that is ultimately an engineering choice, too. Apple chooses to place tight integration over giving users more ability to repair and replace parts.</p>\n<p>To give Apple credit, this tight integration is part of what gives Apple devices longevity. Predictable parts means that Apple can optimise future operating systems to known targets, which is helpful if you want to ensure an older phone is usable with newer software. But I think still think it&rsquo;s the wrong call. While it gives technical advantage, it increases e-waste and ultimately lessens the lifespan of the device.</p>\n<p>Apple doesn&rsquo;t have to create modular phones that are incredibly easy to repair, although it would be fantastic if it applied its undoubted engineering prowess to doing so. There are a lot of things it <em>could</em> do which aren&rsquo;t as radical as that. Apple <em>could</em> publish its calibration processes, which would make third party repair easier. It <em>could</em> publish the schematics for its devices, as for example Fairphone do (but other phone makers don&rsquo;t). It <em>chooses</em> not to do these things. Everything about Apple&rsquo;s behaviour here is a choice, one that it could and should change.</p>\n<p>(And before someone jumps in with &ldquo;fiduciary duty to maximise profits blah blah&rdquo; &ndash; even in the US, where shareholder primacy is fairly well established, courts have long held that shareholder value is not the same as simple profits.)</p>\n<p>Five billion mobile phones will be thrown away this year, <a href=\"https://www.bbc.co.uk/news/science-environment-63245150\">and the majority of them will not be recycled</a>. Apple is in a position to do something which benefits its customers and society – and it is choosing not to. It could lead the industry. Instead, it&rsquo;s contributing to making the planet a less healthy, more polluted place. History will not be kind on the likes of Apple.</p>\n<p>(PS This is a bit of an experiment in publishing something to my Micro.blog rather than Wordpress, so bare with me if it goes a bit wrong.)</p>\n",
				"content_text": "I largely agree with [Nick Heer's take on Apple's policies on repair](https://pxlnv.com/blog/the-fix-is-in/) – and the criticisms thereof. I don't think Apple goes out of their way to engineer things which are harder to repair, and nor do I believe they deliberately engineer-in stuff which breaks third party repairs. They just build stuff to incredibly tight tolerances and are very specific about parts. **But...** that is ultimately an engineering choice, too. Apple chooses to place tight integration over giving users more ability to repair and replace parts. \r\n\r\nTo give Apple credit, this tight integration is part of what gives Apple devices longevity. Predictable parts means that Apple can optimise future operating systems to known targets, which is helpful if you want to ensure an older phone is usable with newer software. But I think still think it's the wrong call. While it gives technical advantage, it increases e-waste and ultimately lessens the lifespan of the device. \r\n\r\nApple doesn't have to create modular phones that are incredibly easy to repair, although it would be fantastic if it applied its undoubted engineering prowess to doing so. There are a lot of things it *could* do which aren't as radical as that. Apple *could* publish its calibration processes, which would make third party repair easier. It *could* publish the schematics for its devices, as for example Fairphone do (but other phone makers don't). It *chooses* not to do these things. Everything about Apple's behaviour here is a choice, one that it could and should change. \r\n\r\n(And before someone jumps in with \"fiduciary duty to maximise profits blah blah\" -- even in the US, where shareholder primacy is fairly well established, courts have long held that shareholder value is not the same as simple profits.)\r\n\r\nFive billion mobile phones will be thrown away this year, [and the majority of them will not be recycled](https://www.bbc.co.uk/news/science-environment-63245150). Apple is in a position to do something which benefits its customers and society – and it is choosing not to. It could lead the industry. Instead, it's contributing to making the planet a less healthy, more polluted place. History will not be kind on the likes of Apple. \r\n\r\n(PS This is a bit of an experiment in publishing something to my Micro.blog rather than Wordpress, so bare with me if it goes a bit wrong.)\n",
				"date_published": "2023-08-01T08:27:06+00:00",
				"url": "https://technovia.co.uk/2023/08/01/apple-and-repair.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/01/in-todays-episode.html",
				
				"content_html": "<p>In today&rsquo;s episode of &ldquo;Brexit meets reality&rdquo;&hellip;</p>\n<p><a href=\"https://www.theguardian.com/politics/2023/aug/01/uk-eu-safety-mark-brexit-climbdown\">www.theguardian.com/politics/&hellip;</a></p>\n",
				"content_text": "In today's episode of \"Brexit meets reality\"... \r\n\r\n[www.theguardian.com/politics/...](https://www.theguardian.com/politics/2023/aug/01/uk-eu-safety-mark-brexit-climbdown)\n",
				"date_published": "2023-08-01T08:18:49+00:00",
				"url": "https://technovia.co.uk/2023/08/01/in-todays-episode.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/08/01/i-am-very.html",
				
				"content_html": "<p>I am very pleased to find that The Stinky Meat Project, one of the greatest sites of all time, is still online.</p>\n<p><a href=\"https://www.stinkymeat.net/\">www.stinkymeat.net</a></p>\n",
				"content_text": "I am very pleased to find that The Stinky Meat Project, one of the greatest sites of all time, is still online. \r\n\r\n[www.stinkymeat.net](https://www.stinkymeat.net/)\n",
				"date_published": "2023-07-31T23:03:34+00:00",
				"url": "https://technovia.co.uk/2023/08/01/i-am-very.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/07/31/looks-like-amazon.html",
				
				"content_html": "<p>Looks like Amazon video has reached the stage of enshittification where, having enticed businesses on to their platform, they start treating them like shit too.</p>\n<p><a href=\"https://www.streamtvinsider.com/video/amazon-modifies-ad-revenue-impressions-share-policy-international-fire-tv-apps\">www.streamtvinsider.com/video/ama&hellip;</a></p>\n",
				"content_text": "Looks like Amazon video has reached the stage of enshittification where, having enticed businesses on to their platform, they start treating them like shit too. \r\n\r\n[www.streamtvinsider.com/video/ama...](https://www.streamtvinsider.com/video/amazon-modifies-ad-revenue-impressions-share-policy-international-fire-tv-apps)\n",
				"date_published": "2023-07-31T22:38:16+00:00",
				"url": "https://technovia.co.uk/2023/07/31/looks-like-amazon.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/07/31/hmm-can-anyone.html",
				
				"content_html": "<p>Hmm, can anyone think of the 1001 ways this can go wrong?</p>\n<p><a href=\"https://www.axios.com/2023/07/31/google-assistant-artificial-intelligence-news\">www.axios.com/2023/07/3&hellip;</a></p>\n",
				"content_text": "Hmm, can anyone think of the 1001 ways this can go wrong? \r\n\r\n[www.axios.com/2023/07/3...](https://www.axios.com/2023/07/31/google-assistant-artificial-intelligence-news)\n",
				"date_published": "2023-07-31T20:56:17+00:00",
				"url": "https://technovia.co.uk/2023/07/31/hmm-can-anyone.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/07/31/this-is-a.html",
				
				"content_html": "<p>This is a really good summary of why iCloud Drive is really good, until it&rsquo;s not, at which point you had better start praying to whatever deities you believe in if you want to fix it.</p>\n<p><a href=\"https://eclecticlight.co/2023/07/24/how-to-fix-problems-with-icloud-and-icloud-drive/\">eclecticlight.co/2023/07/2&hellip;</a></p>\n",
				"content_text": "This is a really good summary of why iCloud Drive is really good, until it's not, at which point you had better start praying to whatever deities you believe in if you want to fix it. \r\n\r\n[eclecticlight.co/2023/07/2...](https://eclecticlight.co/2023/07/24/how-to-fix-problems-with-icloud-and-icloud-drive/)\n",
				"date_published": "2023-07-31T18:36:28+00:00",
				"url": "https://technovia.co.uk/2023/07/31/this-is-a.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/07/31/latenote-monday-st.html",
				"title": "Latenote, Monday 31st July 2023",
				"content_html": "<p>This week, I mostly gave myself a week off which meant I hit level 60 on my character in the new Diablo 4 season. That’s understandable, but I need to make sure that I don’t spend <em>too</em> much time just lazing around even if there is a World Cup to watch.</p>\n<p>If you don’t know about it, the wonderful publisher <a href=\"https://www.andotherstories.org/subscriptions/\">And Other Stories have a brilliant subscription scheme</a>. For £70 a year, you get six books – but you also get your name in the back of the book, and get them a couple of months in advance of publication. That means you have to wait a while for your subscription to kick in, and my first book arrive this week. It’s “<a href=\"https://uk.bookshop.org/a/5025/9781913505721\">Traces of Enayat</a>”, by Iman Mersal, and I’m looking forward to it.</p>\n<h2 id=\"the-three-things-which-most-caught-my-attention\">The three things which most caught my attention</h2>\n<ol>\n<li>Cory not only skewers Tesla (and Musk) in this piece on <a href=\"https://pluralistic.net/2023/07/24/rent-to-pwn/\">Autoshittification</a>, he also draws lines showing how we are being drawn into a form of feudalism.</li>\n<li>I am <a href=\"https://transwrites.world/uk-labour-is-outright-lying-public-support/\">so fucking tired of the Labour Party&rsquo;s duplicitous bullshit on trans rights</a>. Not as tired as my trans friends must be, but still. I won&rsquo;t be voting Labour next time because the party is happy to keep my local MP in place, despite <a href=\"https://www.thepinknews.com/2023/02/02/rosie-duffield-labour-mp-trans-views/\">spouting hatred at every opportunity she gets</a>.</li>\n<li>I don’t entirely agree with the conclusions that Erin Kissane comes to in <a href=\"https://erinkissane.com/mastodon-is-easy-and-fun-except-when-it-isnt\">her article about why Mastodon didn’t stick for a few people</a>, but it’s well worth a read. I think a lot of confusion is down to the expectation that a federated system works (and <strong>should</strong> work) like a centralised one – which is why some people find Bluesky more comforting. A Bluesky which lives up to its intentions would be federated and in many ways as confusing to new users as Mastodon – but at the moment, it’s not actually a federated system. It’s no different to t2, or any one of the plethora of other similar centralised services, other than it was founded by Jack Dorsey.</li>\n</ol>\n<h2 id=\"things-i-have-been-writing\">Things I have been writing</h2>\n<p>I rediscovered a story which I started writing at some point about a doctor who isn’t quite what he appears, and pushed it a bit further. It took me a while to actually realise that <em>I</em> had written it – there are some interesting stylistic tricks in it which I had forgotten playing around with. Along with the story that I developed at Arvon I’m going to finish that in the coming week.</p>\n<h2 id=\"things-i-have-been-reading\">Things I have been reading</h2>\n<p>China Mieville’s “<a href=\"https://uk.bookshop.org/a/5025/9781803289342\">A Spectre, Haunting</a>” crossed my radar and, as it’s a short one, I started reading it. It’s excellent of course, although China is very much in his academic mode rather than entertaining.</p>\n",
				"content_text": "This week, I mostly gave myself a week off which meant I hit level 60 on my character in the new Diablo 4 season. That’s understandable, but I need to make sure that I don’t spend _too_ much time just lazing around even if there is a World Cup to watch. \n\nIf you don’t know about it, the wonderful publisher [And Other Stories have a brilliant subscription scheme](https://www.andotherstories.org/subscriptions/). For £70 a year, you get six books – but you also get your name in the back of the book, and get them a couple of months in advance of publication. That means you have to wait a while for your subscription to kick in, and my first book arrive this week. It’s “[Traces of Enayat](https://uk.bookshop.org/a/5025/9781913505721)”, by Iman Mersal, and I’m looking forward to it.\n\n## The three things which most caught my attention\n1. Cory not only skewers Tesla (and Musk) in this piece on [Autoshittification](https://pluralistic.net/2023/07/24/rent-to-pwn/), he also draws lines showing how we are being drawn into a form of feudalism. \n2. I am [so fucking tired of the Labour Party's duplicitous bullshit on trans rights](https://transwrites.world/uk-labour-is-outright-lying-public-support/). Not as tired as my trans friends must be, but still. I won't be voting Labour next time because the party is happy to keep my local MP in place, despite [spouting hatred at every opportunity she gets](https://www.thepinknews.com/2023/02/02/rosie-duffield-labour-mp-trans-views/).\n3. I don’t entirely agree with the conclusions that Erin Kissane comes to in [her article about why Mastodon didn’t stick for a few people](https://erinkissane.com/mastodon-is-easy-and-fun-except-when-it-isnt), but it’s well worth a read. I think a lot of confusion is down to the expectation that a federated system works (and **should** work) like a centralised one – which is why some people find Bluesky more comforting. A Bluesky which lives up to its intentions would be federated and in many ways as confusing to new users as Mastodon – but at the moment, it’s not actually a federated system. It’s no different to t2, or any one of the plethora of other similar centralised services, other than it was founded by Jack Dorsey. \n\n## Things I have been writing\nI rediscovered a story which I started writing at some point about a doctor who isn’t quite what he appears, and pushed it a bit further. It took me a while to actually realise that _I_ had written it – there are some interesting stylistic tricks in it which I had forgotten playing around with. Along with the story that I developed at Arvon I’m going to finish that in the coming week. \n\n## Things I have been reading\nChina Mieville’s “[A Spectre, Haunting](https://uk.bookshop.org/a/5025/9781803289342)” crossed my radar and, as it’s a short one, I started reading it. It’s excellent of course, although China is very much in his academic mode rather than entertaining. \n\n",
				"date_published": "2023-07-31T07:05:51+00:00",
				"url": "https://technovia.co.uk/2023/07/31/latenote-monday-st.html",
				"tags": ["Weeknotes"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/07/29/hot-dog.html",
				
				"content_html": "<p>Hot. Dog.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Hot. Dog. \n\n<img src=\"uploads/2023/image.jpg\" width=\"450\" height=\"600\" alt=\"A hole in the wall (literally) hot dog place in Hastings. \">\n",
				"date_published": "2023-07-29T12:54:32+00:00",
				"url": "https://technovia.co.uk/2023/07/29/hot-dog.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/07/26/im-thinking-of.html",
				
				"content_html": "<p>I&rsquo;m thinking of moving my blog from Wordpress on to something else, and Micro.blog ticks a lot of boxes: incorporates ActivityPub and RSS; can do both short posts and long posts easily; easy to use; static site generation; small (but great) company. Hmm.</p>\n",
				"content_text": "I'm thinking of moving my blog from Wordpress on to something else, and Micro.blog ticks a lot of boxes: incorporates ActivityPub and RSS; can do both short posts and long posts easily; easy to use; static site generation; small (but great) company. Hmm.\n",
				"date_published": "2023-07-26T08:10:20+00:00",
				"url": "https://technovia.co.uk/2023/07/26/im-thinking-of.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/07/26/god-alexia-putellas.html",
				
				"content_html": "<p>God Alexia Putellas is good. Really good close control and vision.</p>\n",
				"content_text": "God Alexia Putellas is good. Really good close control and vision. \n",
				"date_published": "2023-07-26T07:48:10+00:00",
				"url": "https://technovia.co.uk/2023/07/26/god-alexia-putellas.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/07/26/there-is-a.html",
				
				"content_html": "<p>There is a player for Costa Rica called Pricila Chinchilla which may be the greatest name in football history.</p>\n",
				"content_text": "There is a player for Costa Rica called Pricila Chinchilla which may be the greatest name in football history.\n",
				"date_published": "2023-07-26T06:47:41+00:00",
				"url": "https://technovia.co.uk/2023/07/26/there-is-a.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/07/25/the-sky-glass.html",
				
				"content_html": "<p>The Sky Glass advert is basically &ldquo;here&rsquo;s all the features Apple has in Apple TV but we will charge you £17 a month plus a Sky subscription for it.&rdquo;</p>\n",
				"content_text": "The Sky Glass advert is basically \"here's all the features Apple has in Apple TV but we will charge you £17 a month plus a Sky subscription for it.\"\n",
				"date_published": "2023-07-25T07:57:51+00:00",
				"url": "https://technovia.co.uk/2023/07/25/the-sky-glass.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/07/02/its-genuinely-shocking.html",
				
				"content_html": "<p>It&rsquo;s genuinely shocking how Musk has managed to completely destroy his reputation as a competent business person with the Twitter acquisition. I can&rsquo;t think of a historical parallel.</p>\n",
				"content_text": "It's genuinely shocking how Musk has managed to completely destroy his reputation as a competent business person with the Twitter acquisition. I can't think of a historical parallel. \n",
				"date_published": "2023-07-02T07:10:27+00:00",
				"url": "https://technovia.co.uk/2023/07/02/its-genuinely-shocking.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/07/01/honestly-musk-would.html",
				
				"content_html": "<p>Honestly Musk would have been better off just making Twitter 100% subscription from the day he bought it. At least that would have been a strategy.</p>\n",
				"content_text": "Honestly Musk would have been better off just making Twitter 100% subscription from the day he bought it. At least that would have been a strategy. \n",
				"date_published": "2023-07-01T17:39:49+00:00",
				"url": "https://technovia.co.uk/2023/07/01/honestly-musk-would.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/07/01/fox-on-the.html",
				
				"content_html": "<p>Fox on the left, potential fox snack on the right</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Fox on the left, potential fox snack on the right \n\n<img src=\"uploads/2023/e0962ac774b346a8bb7b39bc5aa06836.jpg\" width=\"600\" height=\"450\" alt=\"A field with a fox watching a rabbit. \">\n",
				"date_published": "2023-07-01T16:44:16+00:00",
				"url": "https://technovia.co.uk/2023/07/01/fox-on-the.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/07/01/well-that-was.html",
				
				"content_html": "<p>Well that was a pretty frustrating performance from England. Lots of chances – Alessia Russo should have had a hat trick – but no luck at all.</p>\n",
				"content_text": "Well that was a pretty frustrating performance from England. Lots of chances – Alessia Russo should have had a hat trick – but no luck at all. \n",
				"date_published": "2023-07-01T16:28:37+00:00",
				"url": "https://technovia.co.uk/2023/07/01/well-that-was.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/06/26/the-new-piece.html",
				
				"content_html": "<p>The new piece in the Turner Contemporary looked really rather nice at the weekend.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "The new piece in the Turner Contemporary looked really rather nice at the weekend. \n\n<img src=\"uploads/2023/df2148efec6a4f5aa0b2bead449bfa96.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-06-26T21:39:42+00:00",
				"url": "https://technovia.co.uk/2023/06/26/the-new-piece.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/06/26/currently-reading-yes.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9781800752221\">Yes! No! But Wait&hellip;!</a> by Tim Lott 📚</p>\n",
				"content_text": "Currently reading: [Yes! No! But Wait...!](https://micro.blog/books/9781800752221) by Tim Lott 📚\n",
				"date_published": "2023-06-26T21:19:20+00:00",
				"url": "https://technovia.co.uk/2023/06/26/currently-reading-yes.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/06/26/today-i-learned.html",
				
				"content_html": "<p>Today I learned that Dave Winer has created another outliner, and now I feel like it&rsquo;s 2000 again and I&rsquo;m using Radio UserLand to publish a blog.</p>\n",
				"content_text": "Today I learned that Dave Winer has created another outliner, and now I feel like it's 2000 again and I'm using Radio UserLand to publish a blog. \n",
				"date_published": "2023-06-26T21:13:32+00:00",
				"url": "https://technovia.co.uk/2023/06/26/today-i-learned.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/06/26/tired.html",
				
				"content_html": "<p>Tired.</p>\n",
				"content_text": "Tired.\n",
				"date_published": "2023-06-26T20:59:24+00:00",
				"url": "https://technovia.co.uk/2023/06/26/tired.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/06/04/weeknote-sunday-th.html",
				"title": "Weeknote, Sunday 4th June 2023",
				"content_html": "<p>I’ve been feeling somewhat melancholy this week. I suspect the cause of that is mostly physical: I have also been feeling quite run down, not to the point of exhaustion but definitely lacking in energy. The two things usually go hand in hand: Kim has occasionally described how my emotions emerge from me like a cloud, surrounding me, and it works both ways. When my body is struggling, my emotions cluster around me, and when I’m feeling strong emotions, I wear it across my body like a gaudy sash.</p>\n<p>We spent part of the last long weekend before August dog sitting two Bedlington terriers who manage to combine whip-smarts with the utter irrationality of all dog kind when it comes to the three things most important to them: snacks, shitting and chasing rabbits. I miss having a dog although I would probably want one that wasn’t <strong>quite</strong> so excitable. An elderly dog who likes a little amble and wistful glance towards the rabbits in the field is probably about my speed.</p>\n<p>On Wednesday we went up to that there London to see <a href=\"https://www.southbankcentre.co.uk/whats-on/literature-poetry/jeremy-deller-art-magic\" title=\"Art is magic\">Jeremy Deller in conversation with Emma Warren</a> talking about <em><a href=\"https://uk.bookshop.org/a/5025/9781800811645\">Art is Magic</a></em>. I love his work – honestly if you don’t like <em>We’re here because we’re here</em> you have no heart – but I also love that he’s not a trained artist, didn’t go to art school, and is what the art establishment likes to call and “outsider artist”. That’s a phrase which, of course, reeks of the privilege they have and how they like to project it. We are insiders – you are an outsider. And we all know that outsiders aren’t to be trusted.</p>\n<p>It’s possibly one of the reasons why it’s taken me fifty years to admit to myself that some of what I do might actually be art, rather than <em>craft</em> or <em>a trade</em>. We shall see. It still feels more than a little uncomfortable.</p>\n<p>Kim has been off in France – first Paris, then Montpellier – doing fun art things since Thursday. That meant she didn’t have to suffer the FA Cup Final with me (our friend Edward came round for shit talking and snack eating) and I’m taking the opportunity to do a bunch of chores that have been on my list of things to do for far too long. Related: my back now hurts. One more thing to talk to the doctor about at some point.</p>\n<h2 id=\"things-i-have-been-writing\">Things I have been writing</h2>\n<p><a href=\"https://ianbetteridge.com/2023/06/03/the-time-of-seclusion-and-loss/\" title=\"The time of isolation and loss\">I wrote something on my experience of covid</a>. This isn’t the first thing I have written about the pandemic, but I think it’s the most complete account of how it’s made me feel, and think, and act differently.</p>\n<h2 id=\"things-i-have-been-reading\">Things I have been reading</h2>\n<p>I finished off M John Harrison’s “anti-memoir” <em><a href=\"https://uk.bookshop.org/a/5025/9781800812970\">Wish I was here</a></em> in just a couple of days. It’s very Harrison: don’t expect a linear narrative about the events in his life, or a how-to manual on writing weird fiction. It’s as much a piece of art writing as the rest of his recent work, and has the opacity and determination not to explain things which he’s really been playing around with for a long time.</p>\n<p>Of course I loved it, but I’ve always loved his work, ever since as a nine or 10 year old I picked up a copy of <em>The Centauri Device</em> while on holiday in Spain. I was obsessed with science fiction and this was the only book I would find amongst the tiny selection of English-language paperbacks in the Spanish newsagent which catered to Brits on their cheap package holiday. Harold Robbins, James Clavell, Dennis Wheatley and M John Harrison. I have sometimes wondered quite how they ended up stocking it, but whoever decided that a Spanish newsagent was the right place for a story of spacefaring anarchists deserves my thanks.</p>\n<p>I’m not sure what to read next. This is always an interesting moment: a few days of paralysis while I work out what my brain wants to absorb. I’m tempted to jump into <em><a href=\"https://uk.bookshop.org/a/5025/9780141986388\">Goodbye, Things</a></em> by Fumio Sasaki as a bit of a break from fiction. It’s been in the book pile for a couple of weeks, which is usually the optimum time for reading: any longer, and it tends to get buried by other options. Any shorter, and it interrupts what I’m already reading. And I hate to stop reading a book before the end: abandoning something always feels like a moral failure, even though intellectually I know it’s the right thing to do.</p>\n",
				"content_text": "I’ve been feeling somewhat melancholy this week. I suspect the cause of that is mostly physical: I have also been feeling quite run down, not to the point of exhaustion but definitely lacking in energy. The two things usually go hand in hand: Kim has occasionally described how my emotions emerge from me like a cloud, surrounding me, and it works both ways. When my body is struggling, my emotions cluster around me, and when I’m feeling strong emotions, I wear it across my body like a gaudy sash.\n\nWe spent part of the last long weekend before August dog sitting two Bedlington terriers who manage to combine whip-smarts with the utter irrationality of all dog kind when it comes to the three things most important to them: snacks, shitting and chasing rabbits. I miss having a dog although I would probably want one that wasn’t **quite** so excitable. An elderly dog who likes a little amble and wistful glance towards the rabbits in the field is probably about my speed.\n\nOn Wednesday we went up to that there London to see [Jeremy Deller in conversation with Emma Warren](https://www.southbankcentre.co.uk/whats-on/literature-poetry/jeremy-deller-art-magic \"Art is magic\") talking about _[Art is Magic](https://uk.bookshop.org/a/5025/9781800811645)_. I love his work – honestly if you don’t like _We’re here because we’re here_ you have no heart – but I also love that he’s not a trained artist, didn’t go to art school, and is what the art establishment likes to call and “outsider artist”. That’s a phrase which, of course, reeks of the privilege they have and how they like to project it. We are insiders – you are an outsider. And we all know that outsiders aren’t to be trusted.\n\nIt’s possibly one of the reasons why it’s taken me fifty years to admit to myself that some of what I do might actually be art, rather than _craft_ or _a trade_. We shall see. It still feels more than a little uncomfortable.\n\nKim has been off in France – first Paris, then Montpellier – doing fun art things since Thursday. That meant she didn’t have to suffer the FA Cup Final with me (our friend Edward came round for shit talking and snack eating) and I’m taking the opportunity to do a bunch of chores that have been on my list of things to do for far too long. Related: my back now hurts. One more thing to talk to the doctor about at some point.\n\n## Things I have been writing\n[I wrote something on my experience of covid](https://ianbetteridge.com/2023/06/03/the-time-of-seclusion-and-loss/ \"The time of isolation and loss\"). This isn’t the first thing I have written about the pandemic, but I think it’s the most complete account of how it’s made me feel, and think, and act differently. \n\n## Things I have been reading\nI finished off M John Harrison’s “anti-memoir” _[Wish I was here](https://uk.bookshop.org/a/5025/9781800812970)_ in just a couple of days. It’s very Harrison: don’t expect a linear narrative about the events in his life, or a how-to manual on writing weird fiction. It’s as much a piece of art writing as the rest of his recent work, and has the opacity and determination not to explain things which he’s really been playing around with for a long time. \n\nOf course I loved it, but I’ve always loved his work, ever since as a nine or 10 year old I picked up a copy of _The Centauri Device_ while on holiday in Spain. I was obsessed with science fiction and this was the only book I would find amongst the tiny selection of English-language paperbacks in the Spanish newsagent which catered to Brits on their cheap package holiday. Harold Robbins, James Clavell, Dennis Wheatley and M John Harrison. I have sometimes wondered quite how they ended up stocking it, but whoever decided that a Spanish newsagent was the right place for a story of spacefaring anarchists deserves my thanks. \n\nI’m not sure what to read next. This is always an interesting moment: a few days of paralysis while I work out what my brain wants to absorb. I’m tempted to jump into _[Goodbye, Things](https://uk.bookshop.org/a/5025/9780141986388)_ by Fumio Sasaki as a bit of a break from fiction. It’s been in the book pile for a couple of weeks, which is usually the optimum time for reading: any longer, and it tends to get buried by other options. Any shorter, and it interrupts what I’m already reading. And I hate to stop reading a book before the end: abandoning something always feels like a moral failure, even though intellectually I know it’s the right thing to do.\n\n",
				"date_published": "2023-06-04T13:07:40+00:00",
				"url": "https://technovia.co.uk/2023/06/04/weeknote-sunday-th.html",
				"tags": ["Weeknotes"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/06/03/the-time-of.html",
				"title": "The time of seclusion and loss",
				"content_html": "<p>I think it’s only now, with the benefit of two years of processing, that I’m really able to think and write about covid and the lockdowns of March 2020 onwards. And it’s only now that I have started to feel like life has really resumed, that I’m able to just go out and do things: see art, go to talks, listen to live music. In the last few months, something has resumed. It’s not my old life, but it is something.</p>\n<p>There was that amazingly strange moment in time when everyone was effectively housebound, confined in a way which no British population in history had been before. You couldn’t drive anywhere unless it was to get to essential work, or to shop – and if you did shop, only one person from a household was allowed to go unless there were extenuating circumstances. You could leave the house to exercise, for as long as you wanted, but only meeting the people within your household. Friends and strangers alike had to be kept at a distance. If someone was coming your way, you crossed the road to avoid them.</p>\n<p>Before lockdown there was a period when everyone knew it was coming but everyone wanted to believe that washing your hands for 20 seconds was the solution. It hit us early. On the 13th March – naturally a Friday – one of our friends came from London for a visit. By Sunday, he was sick enough for us to have to drive him home, with rumours swirling that London would enter a lockdown which might see no one able to come in or out of it.</p>\n<p>By Wednesday 18th March I was sick too. A minor cough, but what made me know it was covid was the exhaustion. It took me 30 minutes to write a five line email to my manager at work, telling her I thought I had covid, because I barely had the strength to type. Then Kim was sick. There were no tests available: the few PCR tests were going to hospitals. If you got sick, you just had to wait and hope it didn’t get bad enough for you to need an ambulance, breathing apparatus, intubation, critical care.</p>\n<p>And the following Monday, 23rd March 2020, everyone was ordered to stay in their homes.</p>\n<p>In lockdown, one weekend we walked from our home up on Tyler Hill in Canterbury down to one of the city centre parks because we had heard a rumour that there was a stall still selling takeaway coffee due to some kind of loophole in the regulations. A two mile walk to get a cappuccino. I almost cried – it was the first time in weeks that I had felt that somehow, perhaps, things might get better.</p>\n<p>Lockdown has affected everything. I look at the fashions of the young people at university – kids who spent nearly two crucial years barely able to socialise with their friends except online – and they wear the kind of clothes that everyone adopts when they don’t have to leave the house: baggy sportswear, shapeless and comfortable, with none of the effort or styling which usually moulds your appearance at that age. It’s a bland conformity driven not by the surrounding culture but by a lack of surrounding culture. Humans are social animals: when that sociability turns into something which might kill them, they suffer.</p>\n<p>And everyone I know has suffered in one way or another. Social bonds, prematurely loosened to the point of breakage. Friendships that took a hiatus during lockdown and have never returned. Mental health which means you struggle around strangers, or desperately seek the company of someone, anyone, while finding company strangely unrewarding.</p>\n<p>No one feels like they did. And I don’t know anyone who feels they used the experience of lockdown and changed for the better. I know plenty of people for whom that was an intention: lockdown as a time to stop, a time to reinvent themselves, a time to study and take the time to read. But I don’t know anyone who came out of it more healthy or wise than they went into it.</p>\n<p>I worry about kids. I know it’s possible to recover from badly disrupted schooling and from mental health issues in childhood (I went through it) but this is different. This was a mass trauma and I think we are, as always underestimating quite what an effect it will have both on individuals and our whole society. Children are more resilient than the mythologisers of childhood innocence would believe, but they are also more vulnerable than the stiff-upper-lip brigade fantasise about.</p>\n<p>Covid isn’t over. While the rhetoric of “learning to live with covid” has been used as an ideological figleaf for a government policy of ignoring it and pretending it didn’t happen the truth is that we **do ** have to learn to live with it. It’s not going away and the wise course of action would be to put as many mitigations in place to prevent future outbreaks as possible. Better ventilation in buildings, encouraging wearing masks (as the Japanese always have) when you feel even slightly under the weather, and of course a consistent public campaign of booster vaccination could all play a part in ensuring that we never have to go through a lockdown again.</p>\n<p>Our current government, which made a policy platform out of ignoring the consequences of Brexit are of course uniquely unsuited to doing any of this. They are born chancers, riding gamblers’ luck with our futures and our lives. They would rather believe something will come along to make covid go away entirely – or that they can do nothing and it will be someone else’s problem if and when it returns in strength.</p>\n<p>I said earlier that only now has my old life resumed, but that does not mean I am unchanged. I’m in worse physical shape than I was pre-lockdown (and I wasn’t in great shape then). Perhaps connected to having had two bouts of covid, I came out of it with significantly higher blood pressure than I went in, and weighing a fair chunk more. Lack of mobility when I work from home means that, unless I deliberately exercise, my average steps per day hovers down at the 4,000 level rather than over 10,000, which was where it was “in the before times”.</p>\n<p>My mental health suffered too, in ways which it’s hard to put my finger on. I am more anxious (and I was no stranger to anxiety). But I have also become more aware of my own needs in terms of people. Far from being the one who didn’t need a lot of people around him to, it turns out that I do, that I love being around people and function best when I am. Who would have predicted that I am, in fact, a thoroughly social animal – a perfect exemplar of how most of my fellow humans are?</p>\n<p>It also radicalised me. Covid, and the government’s response to it, exposed the middle ground of politics for what it always was: a comforting lie, something that I wanted to believe was true because I always like to believe everyone has people’s best interests at heart. During lockdown, the capitalists and their cronies came out of the woodwork in droves to dip their snouts in the trough of government money, with chancers (or “entrepreneurs”, in Toryspeak) appearing to sell us billions of pounds of useless PPE, growing fat on margins. Profiteering shits of the kind which appear in any disaster, but which our “third way” centralist politics pretended had gone away.</p>\n<p>Health workers who were clapped in the streets, then denied a decent wage once it was “all over”. Bus and train staff who were lauded as “key workers” in the pandemic and made to risk their lives so that people could continue to do vital work, only to be told they were greedy when they dared to ask for their salaries to rise in line with inflation.</p>\n<p>The old histories always made out that great men make the times. But that’s nonsense. The times make us, and they also show us a little bit of what we really are. We have to live through whatever life throws at us, and the events around us shape us to a far greater degree than we like to admit. Covid, those two years of seclusion and loss, are going to be with us for a very long time. The only thing we can do to make it all more tolerable is to tell our stories, and hope for change.</p>\n",
				"content_text": "I think it’s only now, with the benefit of two years of processing, that I’m really able to think and write about covid and the lockdowns of March 2020 onwards. And it’s only now that I have started to feel like life has really resumed, that I’m able to just go out and do things: see art, go to talks, listen to live music. In the last few months, something has resumed. It’s not my old life, but it is something.\n\nThere was that amazingly strange moment in time when everyone was effectively housebound, confined in a way which no British population in history had been before. You couldn’t drive anywhere unless it was to get to essential work, or to shop – and if you did shop, only one person from a household was allowed to go unless there were extenuating circumstances. You could leave the house to exercise, for as long as you wanted, but only meeting the people within your household. Friends and strangers alike had to be kept at a distance. If someone was coming your way, you crossed the road to avoid them.\n\nBefore lockdown there was a period when everyone knew it was coming but everyone wanted to believe that washing your hands for 20 seconds was the solution. It hit us early. On the 13th March – naturally a Friday – one of our friends came from London for a visit. By Sunday, he was sick enough for us to have to drive him home, with rumours swirling that London would enter a lockdown which might see no one able to come in or out of it. \n\nBy Wednesday 18th March I was sick too. A minor cough, but what made me know it was covid was the exhaustion. It took me 30 minutes to write a five line email to my manager at work, telling her I thought I had covid, because I barely had the strength to type. Then Kim was sick. There were no tests available: the few PCR tests were going to hospitals. If you got sick, you just had to wait and hope it didn’t get bad enough for you to need an ambulance, breathing apparatus, intubation, critical care.\n\nAnd the following Monday, 23rd March 2020, everyone was ordered to stay in their homes.\n\nIn lockdown, one weekend we walked from our home up on Tyler Hill in Canterbury down to one of the city centre parks because we had heard a rumour that there was a stall still selling takeaway coffee due to some kind of loophole in the regulations. A two mile walk to get a cappuccino. I almost cried – it was the first time in weeks that I had felt that somehow, perhaps, things might get better. \n\nLockdown has affected everything. I look at the fashions of the young people at university – kids who spent nearly two crucial years barely able to socialise with their friends except online – and they wear the kind of clothes that everyone adopts when they don’t have to leave the house: baggy sportswear, shapeless and comfortable, with none of the effort or styling which usually moulds your appearance at that age. It’s a bland conformity driven not by the surrounding culture but by a lack of surrounding culture. Humans are social animals: when that sociability turns into something which might kill them, they suffer. \n\nAnd everyone I know has suffered in one way or another. Social bonds, prematurely loosened to the point of breakage. Friendships that took a hiatus during lockdown and have never returned. Mental health which means you struggle around strangers, or desperately seek the company of someone, anyone, while finding company strangely unrewarding. \n\nNo one feels like they did. And I don’t know anyone who feels they used the experience of lockdown and changed for the better. I know plenty of people for whom that was an intention: lockdown as a time to stop, a time to reinvent themselves, a time to study and take the time to read. But I don’t know anyone who came out of it more healthy or wise than they went into it.\n\nI worry about kids. I know it’s possible to recover from badly disrupted schooling and from mental health issues in childhood (I went through it) but this is different. This was a mass trauma and I think we are, as always underestimating quite what an effect it will have both on individuals and our whole society. Children are more resilient than the mythologisers of childhood innocence would believe, but they are also more vulnerable than the stiff-upper-lip brigade fantasise about. \n\nCovid isn’t over. While the rhetoric of “learning to live with covid” has been used as an ideological figleaf for a government policy of ignoring it and pretending it didn’t happen the truth is that we **do ** have to learn to live with it. It’s not going away and the wise course of action would be to put as many mitigations in place to prevent future outbreaks as possible. Better ventilation in buildings, encouraging wearing masks (as the Japanese always have) when you feel even slightly under the weather, and of course a consistent public campaign of booster vaccination could all play a part in ensuring that we never have to go through a lockdown again. \n\nOur current government, which made a policy platform out of ignoring the consequences of Brexit are of course uniquely unsuited to doing any of this. They are born chancers, riding gamblers’ luck with our futures and our lives. They would rather believe something will come along to make covid go away entirely – or that they can do nothing and it will be someone else’s problem if and when it returns in strength.\n\nI said earlier that only now has my old life resumed, but that does not mean I am unchanged. I’m in worse physical shape than I was pre-lockdown (and I wasn’t in great shape then). Perhaps connected to having had two bouts of covid, I came out of it with significantly higher blood pressure than I went in, and weighing a fair chunk more. Lack of mobility when I work from home means that, unless I deliberately exercise, my average steps per day hovers down at the 4,000 level rather than over 10,000, which was where it was “in the before times”. \n\nMy mental health suffered too, in ways which it’s hard to put my finger on. I am more anxious (and I was no stranger to anxiety). But I have also become more aware of my own needs in terms of people. Far from being the one who didn’t need a lot of people around him to, it turns out that I do, that I love being around people and function best when I am. Who would have predicted that I am, in fact, a thoroughly social animal – a perfect exemplar of how most of my fellow humans are? \n\nIt also radicalised me. Covid, and the government’s response to it, exposed the middle ground of politics for what it always was: a comforting lie, something that I wanted to believe was true because I always like to believe everyone has people’s best interests at heart. During lockdown, the capitalists and their cronies came out of the woodwork in droves to dip their snouts in the trough of government money, with chancers (or “entrepreneurs”, in Toryspeak) appearing to sell us billions of pounds of useless PPE, growing fat on margins. Profiteering shits of the kind which appear in any disaster, but which our “third way” centralist politics pretended had gone away.\n\n Health workers who were clapped in the streets, then denied a decent wage once it was “all over”. Bus and train staff who were lauded as “key workers” in the pandemic and made to risk their lives so that people could continue to do vital work, only to be told they were greedy when they dared to ask for their salaries to rise in line with inflation. \n\nThe old histories always made out that great men make the times. But that’s nonsense. The times make us, and they also show us a little bit of what we really are. We have to live through whatever life throws at us, and the events around us shape us to a far greater degree than we like to admit. Covid, those two years of seclusion and loss, are going to be with us for a very long time. The only thing we can do to make it all more tolerable is to tell our stories, and hope for change.\n\n",
				"date_published": "2023-06-03T11:41:56+00:00",
				"url": "https://technovia.co.uk/2023/06/03/the-time-of.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/05/28/weeknote-sunday-th.html",
				"title": "Weeknote, Sunday 28th May 2023",
				"content_html": "<p>Bank holiday! Another one! Yay!</p>\n<p>On Friday we went over to Margate to see <em>The Chimera Function</em>, a performance lecture by artist and researched Lo Lo No which involved quite a bit of cutup spoken word stuff. I had never been to the Tom Thumb Theatre before and loved it – the work was pretty interesting, and if you’re interested in experimental spoken-word stuff I would recommend seeing it if you get the chance.</p>\n<p>Saturday night I was doing my own spoken word piece at the Free Range open mic night. My work isn’t experimental: I just like telling stories. And as part of it I told my own story, or rather the story of how I didn’t write any stories for over 40 years and finally started when I decided that was really silly.</p>\n<p>After that we went along to our friend Edward’s birthday drink, then headed home via a really rather large Five Guys burger (grilled cheese for me, of course). Memo to self: you really don’t need to have even the medium fries. Small is more than enough.</p>\n<p>Today was my fortnightly writing group, but I ended up only being able to stay for an hour because I planned to meet up with Kim and head over to Herne Bay to collect her mobile phone (she had left it on the bus on Saturday night, and I needed to be with her to find the bus station where it had been left after being found).</p>\n<p>I also took delivery of a new monitor. A couple of months ago I moved the Mac mini and my old monitor out of my study to give myself more desk space, so have been using my laptop on its own. It hasn’t quite worked: although it was nice to have such an open and uncluttered desk, leaning over a laptop doesn’t suit my body, and propping it up on a stand just means I end up peering into the 13in screen from a distance which isn’t great for my eyes.</p>\n<p>The new monitor is a Dell S2722QC USB-C 27in 4K thing, which is similar to the ones we use in the office. It’s good – not only does having USB-C mean that I can connect and charge my laptop on it. But Dell’s stands allow me to move the monitor up and down which my old LG couldn’t. So no more having a monitor on top of a stand which isn’t quite the right height.</p>\n<p>I didn’t realise how much the details of the environment that I work in made a difference to how I feel about working. Things like having a decent keyboard, a screen that’s the right size and height, and all the other things make a big difference not only on things like my posture and my back but also in how producing and creative I feel. It sounds stupid, but it’s true.</p>\n<h2 id=\"things-i-have-been-writing\">Things I have been writing</h2>\n<p>At today’s writing group I only had about half an hour so dived in and wrote a short piece of micro-fiction which I’m quite happy with – so I will be publishing that on <a href=\"https://write.as/ianbetteridge\">the writing blog</a> at some point soon.</p>\n<h2 id=\"things-i-have-been-reading\">Things I have been reading</h2>\n<p>I have been continuing on with <em>Temereire</em>, which is a fun and easy read. This week also saw the arrival of M John Harrison’s <em>Wish I was here</em> too, which is a sort-of biography from my absolute favourite author. I’m looking forward to diving into that.</p>\n",
				"content_text": "Bank holiday! Another one! Yay!\n\nOn Friday we went over to Margate to see _The Chimera Function_, a performance lecture by artist and researched Lo Lo No which involved quite a bit of cutup spoken word stuff. I had never been to the Tom Thumb Theatre before and loved it – the work was pretty interesting, and if you’re interested in experimental spoken-word stuff I would recommend seeing it if you get the chance. \n\nSaturday night I was doing my own spoken word piece at the Free Range open mic night. My work isn’t experimental: I just like telling stories. And as part of it I told my own story, or rather the story of how I didn’t write any stories for over 40 years and finally started when I decided that was really silly. \n\nAfter that we went along to our friend Edward’s birthday drink, then headed home via a really rather large Five Guys burger (grilled cheese for me, of course). Memo to self: you really don’t need to have even the medium fries. Small is more than enough. \n\nToday was my fortnightly writing group, but I ended up only being able to stay for an hour because I planned to meet up with Kim and head over to Herne Bay to collect her mobile phone (she had left it on the bus on Saturday night, and I needed to be with her to find the bus station where it had been left after being found). \n\nI also took delivery of a new monitor. A couple of months ago I moved the Mac mini and my old monitor out of my study to give myself more desk space, so have been using my laptop on its own. It hasn’t quite worked: although it was nice to have such an open and uncluttered desk, leaning over a laptop doesn’t suit my body, and propping it up on a stand just means I end up peering into the 13in screen from a distance which isn’t great for my eyes. \n\nThe new monitor is a Dell S2722QC USB-C 27in 4K thing, which is similar to the ones we use in the office. It’s good – not only does having USB-C mean that I can connect and charge my laptop on it. But Dell’s stands allow me to move the monitor up and down which my old LG couldn’t. So no more having a monitor on top of a stand which isn’t quite the right height. \n\nI didn’t realise how much the details of the environment that I work in made a difference to how I feel about working. Things like having a decent keyboard, a screen that’s the right size and height, and all the other things make a big difference not only on things like my posture and my back but also in how producing and creative I feel. It sounds stupid, but it’s true. \n\n## Things I have been writing\nAt today’s writing group I only had about half an hour so dived in and wrote a short piece of micro-fiction which I’m quite happy with – so I will be publishing that on [the writing blog](https://write.as/ianbetteridge) at some point soon. \n\n## Things I have been reading\nI have been continuing on with _Temereire_, which is a fun and easy read. This week also saw the arrival of M John Harrison’s _Wish I was here_ too, which is a sort-of biography from my absolute favourite author. I’m looking forward to diving into that. \n\n",
				"date_published": "2023-05-28T21:05:49+00:00",
				"url": "https://technovia.co.uk/2023/05/28/weeknote-sunday-th.html",
				"tags": ["Weeknotes"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/05/21/weeknote-sunday-st.html",
				"title": "Weeknote, Sunday 21st May 2023",
				"content_html": "<p>There’s been a lot of London this week. I’m doing a stint of training sessions for various teams across the business – eight sessions this week, basically two a day – and I prefer to do them from the office so I was in for four days running. The good bit is that I get a later train in (the sessions start at 11, so I can get the 9.21) the bad bit is that it turns out commuting is quite tiring. Who knew???</p>\n<p>It does have some plus points. It’s nice to see people face to face, and to have those kind of serendipitous chats to your colleagues which actually drive some of the more valuable creative work. It’s good to have a proper gap between work and home. The hour on the train serves that function really well. And it’s nice to have to avoid the inevitable temptation of ill-disciplined home work, where I slide out of bed at 8.45 and am furiously typing Teams messages fifteen minutes later.</p>\n<p>I like working at home. But I like working at home <em>on my stuff</em>, rather than the business. That, I like to keep at arms length – and the blurring of home and work life which I fought hard to resist during the pandemic is finally catching up with me. I need more discipline about that, because I have lots of other things which I want to do.</p>\n<p>I was <a href=\"https://twil.momorgan.com/weeknote-0020/\">reading Mo Morgan’s weeknote</a> yesterday and he mentioned switching email providers. I’m not sure if Mo is actually my doppelgänger, but I have been doing <strong>exactly</strong> the same dance this week, working on trying out Fastmail. I’m impressed with it, and I am already certain that at the end of the trial period I’ll move all my email and calendars to it.</p>\n<p>Another service that I’ve been looking at this week is Authory, which I have been using and recommending for a few years. I did an interview with them about how it meets my needs and was gushingly positive. If you don’t know it, and you’re a writer on the web, you should be using it: it basically scans sites that you write for for your work and create a personal archive of it. So, when someone on the site’s audience development team decides that your old content should be redirect fodder for strengthening another article’s rankings, you don’t lose your work.</p>\n<p>(Yes, I have done that to people’s work. I’m sorry.)</p>\n<p>Authory has some really nice features. You can use it to create a portfolio site which has all your content from across the web on it. Or you can have an email susbcription using it, so people get all your stuff if they sign up. Oh, and if you tell it a site where your content is, it will go through and find all the existing content to preserve, which is useful when, like me, you have done a bunch of freelance work over the years.</p>\n<p>I am still getting slightly scratchy about how to set up my desk at home. A few weeks ago I exiled the Mac mini into the spare room, because although it was great it also tended to dominate the desk. I had a computer and pretty big monitor right in front of me, and it just didn’t feel right.</p>\n<p>So I moved the Mac mini and now use my MacBook Air M2. It’s on a stand at the moment, which raise it to a nice height, and I use the Keychron K2 with it which has a lovely action on it. But somehow it still seems like… a lot? Just having the laptop on the desk might be a better option, even though ergonomically I know for a fact that’s terrible. Or maybe I should just go back to having a monitor and a minimal Mac mini setup. Decisions, decisions.</p>\n<p>Yesterday we went down to Chichester and saw “<a href=\"https://www.theguardian.com/artanddesign/2023/may/15/kaye-donachie-song-for-the-last-act-review-pallant-house-gallery-chichester-gwen-john\">Kaye Donachie: Song for the Last Act</a>” at the Pallant House Gallery. It was really good and I would highly recommend it, and the whole gallery too. Pallant House specialises in modern art and does some really interesting curatorial stuff, contextualising the work in different ways. There’s also some great work by Gwen John, which you need to see.</p>\n<h2 id=\"things-ive-been-reading\">Things I’ve been reading</h2>\n<p>For a bit of a change of pace I’ve been reading <em><a href=\"https://uk.bookshop.org/a/5025/9780007258710\">Temeraire</a></em>, which is basically Napoleonic Wars with dragons. It’s really fun and of course I’m breezing through it.</p>\n",
				"content_text": "There’s been a lot of London this week. I’m doing a stint of training sessions for various teams across the business – eight sessions this week, basically two a day – and I prefer to do them from the office so I was in for four days running. The good bit is that I get a later train in (the sessions start at 11, so I can get the 9.21) the bad bit is that it turns out commuting is quite tiring. Who knew???\n\nIt does have some plus points. It’s nice to see people face to face, and to have those kind of serendipitous chats to your colleagues which actually drive some of the more valuable creative work. It’s good to have a proper gap between work and home. The hour on the train serves that function really well. And it’s nice to have to avoid the inevitable temptation of ill-disciplined home work, where I slide out of bed at 8.45 and am furiously typing Teams messages fifteen minutes later. \n\nI like working at home. But I like working at home _on my stuff_, rather than the business. That, I like to keep at arms length – and the blurring of home and work life which I fought hard to resist during the pandemic is finally catching up with me. I need more discipline about that, because I have lots of other things which I want to do.\n\nI was [reading Mo Morgan’s weeknote](https://twil.momorgan.com/weeknote-0020/) yesterday and he mentioned switching email providers. I’m not sure if Mo is actually my doppelgänger, but I have been doing **exactly** the same dance this week, working on trying out Fastmail. I’m impressed with it, and I am already certain that at the end of the trial period I’ll move all my email and calendars to it.\n\nAnother service that I’ve been looking at this week is Authory, which I have been using and recommending for a few years. I did an interview with them about how it meets my needs and was gushingly positive. If you don’t know it, and you’re a writer on the web, you should be using it: it basically scans sites that you write for for your work and create a personal archive of it. So, when someone on the site’s audience development team decides that your old content should be redirect fodder for strengthening another article’s rankings, you don’t lose your work.\n\n(Yes, I have done that to people’s work. I’m sorry.)\n\nAuthory has some really nice features. You can use it to create a portfolio site which has all your content from across the web on it. Or you can have an email susbcription using it, so people get all your stuff if they sign up. Oh, and if you tell it a site where your content is, it will go through and find all the existing content to preserve, which is useful when, like me, you have done a bunch of freelance work over the years. \n\nI am still getting slightly scratchy about how to set up my desk at home. A few weeks ago I exiled the Mac mini into the spare room, because although it was great it also tended to dominate the desk. I had a computer and pretty big monitor right in front of me, and it just didn’t feel right. \n\nSo I moved the Mac mini and now use my MacBook Air M2. It’s on a stand at the moment, which raise it to a nice height, and I use the Keychron K2 with it which has a lovely action on it. But somehow it still seems like… a lot? Just having the laptop on the desk might be a better option, even though ergonomically I know for a fact that’s terrible. Or maybe I should just go back to having a monitor and a minimal Mac mini setup. Decisions, decisions. \n\nYesterday we went down to Chichester and saw “[Kaye Donachie: Song for the Last Act](https://www.theguardian.com/artanddesign/2023/may/15/kaye-donachie-song-for-the-last-act-review-pallant-house-gallery-chichester-gwen-john)” at the Pallant House Gallery. It was really good and I would highly recommend it, and the whole gallery too. Pallant House specialises in modern art and does some really interesting curatorial stuff, contextualising the work in different ways. There’s also some great work by Gwen John, which you need to see.\n\n## Things I’ve been reading\nFor a bit of a change of pace I’ve been reading _[Temeraire](https://uk.bookshop.org/a/5025/9780007258710)_, which is basically Napoleonic Wars with dragons. It’s really fun and of course I’m breezing through it. \n\n",
				"date_published": "2023-05-21T19:57:20+00:00",
				"url": "https://technovia.co.uk/2023/05/21/weeknote-sunday-st.html",
				"tags": ["Weeknotes"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/05/14/weeknote-sunday-th.html",
				"title": "Weeknote, Sunday 14th May 2023",
				"content_html": "<p>This week was mostly about training at work. Not me doing training: me training other people, and developing supporting materials, and so on. It’s been a while since I did proper training, and it was a lot of work.</p>\n<p>It was also interesting how different groups react differently: I did three sessions and two went really well, while the other felt like an absolute disaster. The people I was training in the hard session weren’t getting what they wanted from the tools I’m training out, and it really showed.</p>\n<p>Wednesday evening I was lucky enough to spend some time in the company of a really lovely set of people at a dinner organised for <em>Interesting</em> by the redoubtable Russell Davies. It reminded me how much I like the company of people that I don’t know, as long as I let go and allow myself to enjoy it. Interesting 2023 is next week and there are still tickets available: I would strongly recommend you go.</p>\n<p>On Friday, I woke up with a nasty sore throat, which meant that I could work, but couldn’t talk. It wasn’t much fun and – as I had the same issue last week when I was unwell – I wonder if it was something connected to that. When I poked around at the very swollen tonsil on the left-hand side, I got a really unpleasant squirt of <strong>something</strong> out, which probably means it was some kind of infection. It feels OK now, but it’s something to keep an eye on.</p>\n<p>It’s not the only thing that’s wrong with me at the moment. I also have an odd trapped nerve in my back, which makes it hard to stand still for long periods of time. Walking is fine, but standing gives me a sore, uncomfortable feeling in my lower back on the left. I think it’s a trapped nerve because of the weird other symptom: when it’s really sore, the front of my left thigh goes a little numb. Getting old is fun!</p>\n<p>It makes me realise quite how much the body is a set of interconnected parts which affect each other. Because I have that pain on the left of my back, when I stand for a long period I tend to put more weight on the right leg and that means I end up with a sore ankle. This is how bodies collapse: not in a single bad thing, but in a small series of problems which cause and amplify each other.</p>\n<p>All fixable of course, and more important, preventable too. I’ll get there.</p>\n<h2 id=\"things-ive-written-this-week\">Things I’ve written this week</h2>\n<p>I wrote a piece of micro-fiction called <em>The memory of everything you ever felt</em>, about a quite unfamiliar kind of hell. It’s only a couple of hundred words, and I’ll post it once I have a chance to edit it.</p>\n<p>I also started a longer short piece about a man who misses his plane and meets someone who is stuck in-between countries, and so has lived in the airport for some unspecified amount of time. If this sounds a bit like <em>The Terminal</em>… well, it’s not. All is not as it seems. It’s another small exploration of The Weird, and I want to finish it off this week.</p>\n<h2 id=\"things-ive-read-this-week\">Things I’ve read this week</h2>\n<p>I finished Julia Armfield’s <em>Our wives under the sea</em>, which was outstanding. I really love her writing style, and I wish I could write this kind of amazing clarity of voice.</p>\n<p>Of course, that means I’m on to the next book — or rather, books. When I finish one thing, I rarely have a great idea of what I’m going to read next, and so I tend to dive into a few books and see what sticks. This week it’s been a few pages of <em>Rooms of their own</em> by Nino Strachey, some of <em>All gates are open</em> by Irmin Schmidt and a bit of Laine Looney’s look at the world of early microcomputers, <em>The Apple II Age</em>. None of them have quite stuck yet, so I may jump into something else instead. There’s a lot on the list.</p>\n",
				"content_text": "This week was mostly about training at work. Not me doing training: me training other people, and developing supporting materials, and so on. It’s been a while since I did proper training, and it was a lot of work. \n\nIt was also interesting how different groups react differently: I did three sessions and two went really well, while the other felt like an absolute disaster. The people I was training in the hard session weren’t getting what they wanted from the tools I’m training out, and it really showed. \n\nWednesday evening I was lucky enough to spend some time in the company of a really lovely set of people at a dinner organised for _Interesting_ by the redoubtable Russell Davies. It reminded me how much I like the company of people that I don’t know, as long as I let go and allow myself to enjoy it. Interesting 2023 is next week and there are still tickets available: I would strongly recommend you go. \n\nOn Friday, I woke up with a nasty sore throat, which meant that I could work, but couldn’t talk. It wasn’t much fun and – as I had the same issue last week when I was unwell – I wonder if it was something connected to that. When I poked around at the very swollen tonsil on the left-hand side, I got a really unpleasant squirt of **something** out, which probably means it was some kind of infection. It feels OK now, but it’s something to keep an eye on.\n\nIt’s not the only thing that’s wrong with me at the moment. I also have an odd trapped nerve in my back, which makes it hard to stand still for long periods of time. Walking is fine, but standing gives me a sore, uncomfortable feeling in my lower back on the left. I think it’s a trapped nerve because of the weird other symptom: when it’s really sore, the front of my left thigh goes a little numb. Getting old is fun!\n\nIt makes me realise quite how much the body is a set of interconnected parts which affect each other. Because I have that pain on the left of my back, when I stand for a long period I tend to put more weight on the right leg and that means I end up with a sore ankle. This is how bodies collapse: not in a single bad thing, but in a small series of problems which cause and amplify each other. \n\nAll fixable of course, and more important, preventable too. I’ll get there. \n\n## Things I’ve written this week\nI wrote a piece of micro-fiction called _The memory of everything you ever felt_, about a quite unfamiliar kind of hell. It’s only a couple of hundred words, and I’ll post it once I have a chance to edit it.\n\nI also started a longer short piece about a man who misses his plane and meets someone who is stuck in-between countries, and so has lived in the airport for some unspecified amount of time. If this sounds a bit like _The Terminal_… well, it’s not. All is not as it seems. It’s another small exploration of The Weird, and I want to finish it off this week.\n\n## Things I’ve read this week\nI finished Julia Armfield’s _Our wives under the sea_, which was outstanding. I really love her writing style, and I wish I could write this kind of amazing clarity of voice. \n\nOf course, that means I’m on to the next book — or rather, books. When I finish one thing, I rarely have a great idea of what I’m going to read next, and so I tend to dive into a few books and see what sticks. This week it’s been a few pages of _Rooms of their own_ by Nino Strachey, some of _All gates are open_ by Irmin Schmidt and a bit of Laine Looney’s look at the world of early microcomputers, _The Apple II Age_. None of them have quite stuck yet, so I may jump into something else instead. There’s a lot on the list. \n\n",
				"date_published": "2023-05-14T18:18:00+00:00",
				"url": "https://technovia.co.uk/2023/05/14/weeknote-sunday-th.html",
				"tags": ["Weeknotes"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/05/08/weeknote-monday-th.html",
				"title": "Weeknote, Monday 8th May",
				"content_html": "<p>I hate being ill, so I have hated this week. After having a tickly throat on Tuesday, Wednesday morning I woke up with a full-blown very sore throat which I couldn’t talk around, plus a head that felt like it was stuffed with old socks found at the bottom of a particularly disreputable drawer. Oh and, of course, the kind of tiredness that makes you feel completely out of control of your body.</p>\n<p>That wrote off Wednesday and Thursday, which, because of the first flush of warm early summer weather, were unpleasantly spent in bed sweating and feeling dreadful. I was finally able to get up on Friday and feel human enough to head down to the sea for an evening “fuck the Tories” ice cream. Wasn’t it wonderful to see them defeated so comprehensively that they immediately had to crown a new king to get everyone distracted?</p>\n<p>On Saturday, I was feeling well enough to demand a drive to a country house and some fresh air, which is how we ended up at Knole in Sevenoaks. It’s part of the character of Sevenoaks – and tells you a lot about it as a place – that there is a large country house and deer park right next to it. Or rather, <em>in</em> it: where most maps look like cities eat away at the surrounding countryside, Sevenoaks seems like Knole has devoured part of it, the green biting a chunk from the concrete grey.</p>\n<p>Knole is an incredibly well-preserved 17th century house and was the home of the Sackville family, who later became the Sackville-West family. Vita Sackville-West was born here, and her inability to inherit the house – denied by British primogeniture laws – was something she was bitter about her entire life. Instead, the house (and title) went to her uncle Charles, who bequeathed it to the National Trust in 1947.</p>\n<h2 id=\"things-i-have-been-reading\">Things I have been reading</h2>\n<p>I skipped a few days reading this week – there is nothing I like less than reading when I’m confined to bed ill – but I have been pressing on with Julia Armfield’s <em><a href=\"https://uk.bookshop.org/a/5025/9781529017250\">Our wives under the sea</a></em>, which I am enjoying a lot. I would love my own writing to be this accomplished. Many passages have been clipped from it, and there are times when she hits the mark with a sentence so well that it almost leaves me breathless. For example:</p>\n<blockquote>\n<p>I see my mother in myself, though less in the sense of inherited features and more in the sense of an intruder poorly hidden behind a curtain.</p>\n</blockquote>\n<p>Or:</p>\n<blockquote>\n<p>Panic is a misuse of oxygen.</p>\n</blockquote>\n<p>At Knole I bought <em><a href=\"https://uk.bookshop.org/a/5025/9781841657882\">Rooms of their own</a></em> by Nino Strachey, which is a large format pictorial book of the rooms of Edward Sackville-West, Vita Sackville-West, and (of course) Virginia Woolf. If you don’t find the Bloomsbury group and their era fascinating, you’re missing out.</p>\n<p>Related, I also bought <em><a href=\"https://uk.bookshop.org/a/5025/9781472132482\">The Crichel Boys</a></em> by Simon Fenwick, which focuses in part on Eddy’s later life when he bought a house down in Dorset with some friends. That will be next on the list – I feel like I’ve read a lot of fiction lately and need to balance it out. Reading books about writers seems like a good half-way house.</p>\n",
				"content_text": "I hate being ill, so I have hated this week. After having a tickly throat on Tuesday, Wednesday morning I woke up with a full-blown very sore throat which I couldn’t talk around, plus a head that felt like it was stuffed with old socks found at the bottom of a particularly disreputable drawer. Oh and, of course, the kind of tiredness that makes you feel completely out of control of your body.\n\nThat wrote off Wednesday and Thursday, which, because of the first flush of warm early summer weather, were unpleasantly spent in bed sweating and feeling dreadful. I was finally able to get up on Friday and feel human enough to head down to the sea for an evening “fuck the Tories” ice cream. Wasn’t it wonderful to see them defeated so comprehensively that they immediately had to crown a new king to get everyone distracted?\n\nOn Saturday, I was feeling well enough to demand a drive to a country house and some fresh air, which is how we ended up at Knole in Sevenoaks. It’s part of the character of Sevenoaks – and tells you a lot about it as a place – that there is a large country house and deer park right next to it. Or rather, _in_ it: where most maps look like cities eat away at the surrounding countryside, Sevenoaks seems like Knole has devoured part of it, the green biting a chunk from the concrete grey.\n\nKnole is an incredibly well-preserved 17th century house and was the home of the Sackville family, who later became the Sackville-West family. Vita Sackville-West was born here, and her inability to inherit the house – denied by British primogeniture laws – was something she was bitter about her entire life. Instead, the house (and title) went to her uncle Charles, who bequeathed it to the National Trust in 1947.\n\n## Things I have been reading\nI skipped a few days reading this week – there is nothing I like less than reading when I’m confined to bed ill – but I have been pressing on with Julia Armfield’s _[Our wives under the sea](https://uk.bookshop.org/a/5025/9781529017250)_, which I am enjoying a lot. I would love my own writing to be this accomplished. Many passages have been clipped from it, and there are times when she hits the mark with a sentence so well that it almost leaves me breathless. For example:\n\n> I see my mother in myself, though less in the sense of inherited features and more in the sense of an intruder poorly hidden behind a curtain.\n\nOr:\n\n> Panic is a misuse of oxygen.\n\nAt Knole I bought _[Rooms of their own](https://uk.bookshop.org/a/5025/9781841657882)_ by Nino Strachey, which is a large format pictorial book of the rooms of Edward Sackville-West, Vita Sackville-West, and (of course) Virginia Woolf. If you don’t find the Bloomsbury group and their era fascinating, you’re missing out.\n\nRelated, I also bought _[The Crichel Boys](https://uk.bookshop.org/a/5025/9781472132482)_ by Simon Fenwick, which focuses in part on Eddy’s later life when he bought a house down in Dorset with some friends. That will be next on the list – I feel like I’ve read a lot of fiction lately and need to balance it out. Reading books about writers seems like a good half-way house.\n\n",
				"date_published": "2023-05-08T12:29:44+00:00",
				"url": "https://technovia.co.uk/2023/05/08/weeknote-monday-th.html",
				"tags": ["Weeknotes"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/05/01/mastodon-bluesky-and.html",
				"title": "Mastodon, BlueSky, and Highlander Syndrome",
				"content_html": "<p>I am total agreement with <a href=\"https://www.jwz.org/blog/2023/04/blue-skies-over-mastodon/\">Jamie Zawinski</a> here. There is no way I will trust anything that Jack Dorsey has anything to do with. He’s either incredibly naive – in which case he should be nowhere near a service which requires trust and safety to be at the front of everyone’s minds – or he knew what Musk was like and didn’t care (in which case… you guessed it).</p>\n<p>I don’t, though, really care if people jump from Twitter to BlueSky. There is room for more than one successful microblogging platform and different people will have priorities which aren’t the same as mine. I don’t particularly want to spent a massive amount of effort on a centralised service, but you might feel differently.</p>\n<p>There is a lot of Highlander syndrome here: “there can be only one” social network which wins, there can be only one platform which everyone must be on. Some of this comes from the narratives which tech journalists love to write about. Conflict sells, conflict drives clicks, and if you can personalise the conflict to two “heroic founder” figures duking it out, all the better.</p>\n<p>This isn’t, by the way, some kind of failing solely in journalism. Our oldest and most fundamental narratives frame things as battles between giants. The myths of gods and heroes are full of them, and seeing founders in the same vein is just part of the same old story. We do it with kings, religious leaders, scientists, you name it. Even our efforts to celebrate the collective often devolve back into hero worship. We’re just not very good at celebrating the collective, unless we have a clear enemy to stand against.</p>\n",
				"content_text": "I am total agreement with [Jamie Zawinski](https://www.jwz.org/blog/2023/04/blue-skies-over-mastodon/) here. There is no way I will trust anything that Jack Dorsey has anything to do with. He’s either incredibly naive – in which case he should be nowhere near a service which requires trust and safety to be at the front of everyone’s minds – or he knew what Musk was like and didn’t care (in which case… you guessed it). \n\nI don’t, though, really care if people jump from Twitter to BlueSky. There is room for more than one successful microblogging platform and different people will have priorities which aren’t the same as mine. I don’t particularly want to spent a massive amount of effort on a centralised service, but you might feel differently. \n\nThere is a lot of Highlander syndrome here: “there can be only one” social network which wins, there can be only one platform which everyone must be on. Some of this comes from the narratives which tech journalists love to write about. Conflict sells, conflict drives clicks, and if you can personalise the conflict to two “heroic founder” figures duking it out, all the better. \n\nThis isn’t, by the way, some kind of failing solely in journalism. Our oldest and most fundamental narratives frame things as battles between giants. The myths of gods and heroes are full of them, and seeing founders in the same vein is just part of the same old story. We do it with kings, religious leaders, scientists, you name it. Even our efforts to celebrate the collective often devolve back into hero worship. We’re just not very good at celebrating the collective, unless we have a clear enemy to stand against.\n\n",
				"date_published": "2023-05-01T20:04:26+00:00",
				"url": "https://technovia.co.uk/2023/05/01/mastodon-bluesky-and.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/01/04/currently-reading-less.html",
				
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9781473581739\">Less is More: How Degrowth Will Save the World</a> by Jason Hickel 📚</p>\n",
				"content_text": "Currently reading: [Less is More: How Degrowth Will Save the World](https://micro.blog/books/9781473581739) by Jason Hickel 📚\n",
				"date_published": "2023-01-04T21:50:49+00:00",
				"url": "https://technovia.co.uk/2023/01/04/currently-reading-less.html"
			},
			{
				"id": "http://ianbetteridge.micro.blog/2023/01/04/im-late-to.html",
				
				"content_html": "<p>I&rsquo;m late to the party with &ldquo;Our Flag Means Death&rdquo; but it&rsquo;s really good.</p>\n",
				"content_text": "I'm late to the party with \"Our Flag Means Death\" but it's really good. \n",
				"date_published": "2023-01-04T21:34:44+00:00",
				"url": "https://technovia.co.uk/2023/01/04/im-late-to.html"
			}
	]
}
